HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axg.h
/**
  ******************************************************************************
  * @file    at32f403axg.h
  * @author  Artery Technology & HorrorTroll
  * @version v2.1.4
  * @date    28-February-2023
  * @brief   CMSIS AT32F403AxG Device Peripheral Access Layer Header File.
  *
  *          The file is the unique include file that the application programmer
  *          is using in the C source code, usually in main.c. This file contains:
  *            - Configuration section that allows to select:
  *              - The AT32F403AxG device used in the target application
  *              - To use or not the peripheral drivers in application code(i.e.
  *                code will be based on direct access to peripheral registers
  *                rather than drivers API), this option is controlled by
  *                "#define USE_HAL_DRIVER"
  *
  ******************************************************************************
  *                       Copyright notice & Disclaimer
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup at32f403axg
  * @{
  */

#ifndef __AT32F403AxG_H
#define __AT32F403AxG_H

#ifdef __cplusplus
 extern "C" {
#endif

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */

/**
  * @brief Configuration of the Cortex-M4 Processor and Core Peripherals
 */
#define __CM4_REV                  0x0001U  /*!< Core Revision r0p1                           */
#define __MPU_PRESENT              1U       /*!< AT32 devices provide an MPU                  */
#define __NVIC_PRIO_BITS           4U       /*!< AT32 uses 4 Bits for the Priority Levels     */
#define __Vendor_SysTickConfig     0U       /*!< Set to 1 if different SysTick Config is used */
#define __FPU_PRESENT              1U       /*!< AT32 devices provide an FPU                  */

/**
  * @}
  */

/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */

/**
 * @brief AT32F403AxG Interrupt Number Definition, according to the selected device
 *        in @ref Library_configuration_section
 */

 /*!< Interrupt Number Definition */
typedef enum
{
/******  Cortex-M4 Processor Exceptions Numbers ***************************************************/
  Reset_IRQn                  = -15,    /*!< 1 Reset Vector Interrupt                             */
  NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                             */
  HardFault_IRQn              = -13,    /*!< 3 Cortex-M4 Hard Fault Interrupt                     */
  MemoryManagement_IRQn       = -12,    /*!< 4 Cortex-M4 Memory Management Interrupt              */
  BusFault_IRQn               = -11,    /*!< 5 Cortex-M4 Bus Fault Interrupt                      */
  UsageFault_IRQn             = -10,    /*!< 6 Cortex-M4 Usage Fault Interrupt                    */
  SVCall_IRQn                 = -5,     /*!< 11 Cortex-M4 SV Call Interrupt                       */
  DebugMonitor_IRQn           = -4,     /*!< 12 Cortex-M4 Debug Monitor Interrupt                 */
  PendSV_IRQn                 = -2,     /*!< 14 Cortex-M4 Pend SV Interrupt                       */
  SysTick_IRQn                = -1,     /*!< 15 Cortex-M4 System Tick Interrupt                   */

/******  AT32 specific Interrupt Numbers **********************************************************/
  WWDT_IRQn                   = 0,      /*!< Window WatchDog Timer Interrupt                      */
  PVM_IRQn                    = 1,      /*!< PVM through EXINT Line detection Interrupt           */
  TAMPER_IRQn                 = 2,      /*!< Tamper Interrupt                                     */
  RTC_IRQn                    = 3,      /*!< RTC global Interrupt                                 */
  FLASH_IRQn                  = 4,      /*!< FLASH global Interrupt                               */
  CRM_IRQn                    = 5,      /*!< CRM global Interrupt                                 */
  EXINT0_IRQn                 = 6,      /*!< EXINT line0 Interrupt                                */
  EXINT1_IRQn                 = 7,      /*!< EXINT line1 Interrupt                                */
  EXINT2_IRQn                 = 8,      /*!< EXINT line2 Interrupt                                */
  EXINT3_IRQn                 = 9,      /*!< EXINT line3 Interrupt                                */
  EXINT4_IRQn                 = 10,     /*!< EXINT line4 Interrupt                                */
  DMA1_Channel1_IRQn          = 11,     /*!< DMA1 Channel 1 global Interrupt                      */
  DMA1_Channel2_IRQn          = 12,     /*!< DMA1 Channel 2 global Interrupt                      */
  DMA1_Channel3_IRQn          = 13,     /*!< DMA1 Channel 3 global Interrupt                      */
  DMA1_Channel4_IRQn          = 14,     /*!< DMA1 Channel 4 global Interrupt                      */
  DMA1_Channel5_IRQn          = 15,     /*!< DMA1 Channel 5 global Interrupt                      */
  DMA1_Channel6_IRQn          = 16,     /*!< DMA1 Channel 6 global Interrupt                      */
  DMA1_Channel7_IRQn          = 17,     /*!< DMA1 Channel 7 global Interrupt                      */
  ADC1_2_IRQn                 = 18,     /*!< ADC1 and ADC2 global Interrupt                       */
  USBFS_H_CAN1_TX_IRQn        = 19,     /*!< USB Device High Priority or CAN1 TX Interrupts       */
  USBFS_L_CAN1_RX0_IRQn       = 20,     /*!< USB Device low Priority or CAN1 RX0 Interrupts       */
  CAN1_RX1_IRQn               = 21,     /*!< CAN1 RX1 Interrupt                                   */
  CAN1_SE_IRQn                = 22,     /*!< CAN1 SE Interrupt                                    */
  EXINT9_5_IRQn               = 23,     /*!< External Line[9:5] Interrupts                        */
  TMR1_BRK_TMR9_IRQn          = 24,     /*!< TMR1 Break Interrupt and TMR9 global Interrupt       */
  TMR1_OVF_TMR10_IRQn         = 25,     /*!< TMR1 Overflow Interrupt and TMR10 global Interrupt   */
  TMR1_TRG_HALL_TMR11_IRQn    = 26,     /*!< TMR1 Trigger and Hall Interrupt and TMR11 global IRQ */
  TMR1_CH_IRQn                = 27,     /*!< TMR1 Channel Interrupt                               */
  TMR2_GLOBAL_IRQn            = 28,     /*!< TMR2 global Interrupt                                */
  TMR3_GLOBAL_IRQn            = 29,     /*!< TMR3 global Interrupt                                */
  TMR4_GLOBAL_IRQn            = 30,     /*!< TMR4 global Interrupt                                */
  I2C1_EVT_IRQn               = 31,     /*!< I2C1 Event Interrupt                                 */
  I2C1_ERR_IRQn               = 32,     /*!< I2C1 Error Interrupt                                 */
  I2C2_EVT_IRQn               = 33,     /*!< I2C2 Event Interrupt                                 */
  I2C2_ERR_IRQn               = 34,     /*!< I2C2 Error Interrupt                                 */
  SPI1_IRQn                   = 35,     /*!< SPI1 global Interrupt                                */
  SPI2_I2S2EXT_IRQn           = 36,     /*!< SPI2 and I2S2EXT global Interrupt                    */
  USART1_IRQn                 = 37,     /*!< USART1 global Interrupt                              */
  USART2_IRQn                 = 38,     /*!< USART2 global Interrupt                              */
  USART3_IRQn                 = 39,     /*!< USART3 global Interrupt                              */
  EXINT15_10_IRQn             = 40,     /*!< External Line[15:10] Interrupts                      */
  RTCAlarm_IRQn               = 41,     /*!< RTC Alarm through EXINT Line Interrupt               */
  USBFSWakeUp_IRQn            = 42,     /*!< USB Device WakeUp through EXINT Line Interrupt       */
  TMR8_BRK_TMR12_IRQn         = 43,     /*!< TMR8 Break Interrupt and TMR12 global Interrupt      */
  TMR8_OVF_TMR13_IRQn         = 44,     /*!< TMR8 Overflow Interrupt and TMR13 global Interrupt   */
  TMR8_TRG_HALL_TMR14_IRQn    = 45,     /*!< TMR8 Trigger and Hall Interrupt and TMR14 global IRQ */
  TMR8_CH_IRQn                = 46,     /*!< TMR8 Channel Interrupt                               */
  ADC3_IRQn                   = 47,     /*!< ADC3 global Interrupt                                */
  XMC_IRQn                    = 48,     /*!< XMC global Interrupt                                 */
  SDIO1_IRQn                  = 49,     /*!< SDIO1 global Interrupt                               */
  TMR5_GLOBAL_IRQn            = 50,     /*!< TMR5 global Interrupt                                */
  SPI3_I2S3EXT_IRQn           = 51,     /*!< SPI3 and I2S3EXT global Interrupt                    */
  UART4_IRQn                  = 52,     /*!< UART4 global Interrupt                               */
  UART5_IRQn                  = 53,     /*!< UART5 global Interrupt                               */
  TMR6_GLOBAL_IRQn            = 54,     /*!< TMR6 global Interrupt                                */
  TMR7_GLOBAL_IRQn            = 55,     /*!< TMR7 global Interrupt                                */
  DMA2_Channel1_IRQn          = 56,     /*!< DMA2 Channel 1 global Interrupt                      */
  DMA2_Channel2_IRQn          = 57,     /*!< DMA2 Channel 2 global Interrupt                      */
  DMA2_Channel3_IRQn          = 58,     /*!< DMA2 Channel 3 global Interrupt                      */
  DMA2_Channel4_5_IRQn        = 59,     /*!< DMA2 Channel 4 and Channel 5 global Interrupt        */
  SDIO2_IRQn                  = 60,     /*!< SDIO2 global Interrupt                               */
  I2C3_EVT_IRQn               = 61,     /*!< I2C3 Event Interrupt                                 */
  I2C3_ERR_IRQn               = 62,     /*!< I2C3 Error Interrupt                                 */
  SPI4_IRQn                   = 63,     /*!< SPI4 global Interrupt                                */
  CAN2_TX_IRQn                = 68,     /*!< CAN2 TX Interrupt                                    */
  CAN2_RX0_IRQn               = 69,     /*!< CAN2 RX0 Interrupt                                   */
  CAN2_RX1_IRQn               = 70,     /*!< CAN2 RX1 Interrupt                                   */
  CAN2_SE_IRQn                = 71,     /*!< CAN2 SE Interrupt                                    */
  ACC_IRQn                    = 72,     /*!< ACC Interrupt                                        */
  USBFS_MAPH_IRQn             = 73,     /*!< USB Remap High priority Interrupt                    */
  USBFS_MAPL_IRQn             = 74,     /*!< USB Remap Low priority Interrupt                     */
  DMA2_Channel6_7_IRQn        = 75,     /*!< DMA2 Channel 6 and Channel 7 global Interrupt        */
  USART6_IRQn                 = 76,     /*!< USART6 global Interrupt                              */
  UART7_IRQn                  = 77,     /*!< UART7 global Interrupt                               */
  UART8_IRQn                  = 78,     /*!< UART8 global Interrupt                               */
} IRQn_Type;

/**
  * @}
  */

#include "core_cm4.h"
#include "system_at32f40xx.h"
#include <stdint.h>

