HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axg.h
typedef struct
{
  __IO uint16_t FAP;                 /*!< USD memory access protection,                Address offset: 0x1FFF_F800               */
  __IO uint16_t SSB;                 /*!< USD System configuration byte,               Address offset: 0x1FFF_F802               */
  __IO uint16_t DATA0;               /*!< USD User data 0,                             Address offset: 0x1FFF_F804               */
  __IO uint16_t DATA1;               /*!< USD User data 1,                             Address offset: 0x1FFF_F806               */
  __IO uint16_t EPP0;                /*!< USD erase/write protection byte 0,           Address offset: 0x1FFF_F808               */
  __IO uint16_t EPP1;                /*!< USD erase/write protection byte 1,           Address offset: 0x1FFF_F80A               */
  __IO uint16_t EPP2;                /*!< USD erase/write protection byte 2,           Address offset: 0x1FFF_F80C               */
  __IO uint16_t EPP3;                /*!< USD erase/write protection byte 3,           Address offset: 0x1FFF_F80E               */
  __IO uint16_t EOPB0;               /*!< USD Extended system options,                 Address offset: 0x1FFF_F810               */
  uint16_t      RESERVED;            /*!< Reserved,                                    Address offset: 0x1FFF_F812 ~ 0x1FFF_F813 */
  __IO uint16_t DATA2;               /*!< USD User data 2,                             Address offset: 0x1FFF_F814               */
  __IO uint16_t DATA3;               /*!< USD User data 3,                             Address offset: 0x1FFF_F816               */
  __IO uint16_t DATA4;               /*!< USD User data 4,                             Address offset: 0x1FFF_F818               */
  __IO uint16_t DATA5;               /*!< USD User data 5,                             Address offset: 0x1FFF_F81A               */
  __IO uint16_t DATA6;               /*!< USD User data 6,                             Address offset: 0x1FFF_F81C               */
  __IO uint16_t DATA7;               /*!< USD User data 7,                             Address offset: 0x1FFF_F81E               */
  __IO uint16_t EXT_FLASH_KEY[8];    /*!< USD Ext memory ciphertext encryption key,    Address offset: 0x1FFF_F820 ~ 0x1FFF_F82F */
} USD_TypeDef;

/**
  * @brief General Purpose I/O
  */

typedef struct
{
  __IO uint32_t CFGLR;          /*!< GPIO configuration register low,             Address offset: 0x00        */
  __IO uint32_t CFGHR;          /*!< GPIO configuration register high,            Address offset: 0x04        */
  __IO uint32_t IDT;            /*!< GPIO input data register,                    Address offset: 0x08        */
  __IO uint32_t ODT;            /*!< GPIO output data register,                   Address offset: 0x0C        */
  __IO uint32_t SCR;            /*!< GPIO set/clear register,                     Address offset: 0x10        */
  __IO uint32_t CLR;            /*!< GPIO clear register,                         Address offset: 0x14        */
  __IO uint32_t WPR;            /*!< GPIO write protection register,              Address offset: 0x18        */
  uint32_t      RESERVED[8];    /*!< Reserved,                                    Address offset: 0x1C ~ 0x38 */
  __IO uint32_t HDRV;           /*!< GPIO huge current control register,          Address offset: 0x3C        */
} GPIO_TypeDef;

/**
  * @brief Multiplex Function I/O
  */

typedef struct
{
  __IO uint32_t EVTOUT;      /*!< IOMUX Event output control register,         Address offset: 0x00 */
  __IO uint32_t REMAP;       /*!< IOMUX remap register 1,                      Address offset: 0x04 */
  __IO uint32_t EXINTC1;     /*!< IOMUX external interrupt config register 1,  Address offset: 0x08 */
  __IO uint32_t EXINTC2;     /*!< IOMUX external interrupt config register 2,  Address offset: 0x0C */
  __IO uint32_t EXINTC3;     /*!< IOMUX external interrupt config register 3,  Address offset: 0x10 */
  __IO uint32_t EXINTC4;     /*!< IOMUX external interrupt config register 4,  Address offset: 0x14 */
  uint32_t      RESERVED;    /*!< Reserved,                                    Address offset: 0x18 */
  __IO uint32_t REMAP2;      /*!< IOMUX remap register 2,                      Address offset: 0x1C */
  __IO uint32_t REMAP3;      /*!< IOMUX remap register 3,                      Address offset: 0x20 */
  __IO uint32_t REMAP4;      /*!< IOMUX remap register 4,                      Address offset: 0x24 */
  __IO uint32_t REMAP5;      /*!< IOMUX remap register 5,                      Address offset: 0x28 */
  __IO uint32_t REMAP6;      /*!< IOMUX remap register 6,                      Address offset: 0x2C */
  __IO uint32_t REMAP7;      /*!< IOMUX remap register 7,                      Address offset: 0x30 */
  __IO uint32_t REMAP8;      /*!< IOMUX remap register 8,                      Address offset: 0x34 */
} IOMUX_TypeDef;

/**
  * @brief Inter Integrated Circuit Interface
  */

typedef struct
{
  __IO uint32_t CTRL1;      /*!< I2C Control register 1,                      Address offset: 0x00 */
  __IO uint32_t CTRL2;      /*!< I2C Control register 2,                      Address offset: 0x04 */
  __IO uint32_t OADDR1;     /*!< I2C Own address register 1,                  Address offset: 0x08 */
  __IO uint32_t OADDR2;     /*!< I2C Own address register 2,                  Address offset: 0x0C */
  __IO uint32_t DT;         /*!< I2C Data register,                           Address offset: 0x10 */
  __IO uint32_t STS1;       /*!< I2C Status register 1,                       Address offset: 0x14 */
  __IO uint32_t STS2;       /*!< I2C Status register 2,                       Address offset: 0x18 */
  __IO uint32_t CLKCTRL;    /*!< I2C Clock control register,                  Address offset: 0x1C */
  __IO uint32_t TMRISE;     /*!< I2C timer rise time register,                Address offset: 0x20 */
} I2C_TypeDef;

/**
  * @brief Power Control
  */

typedef struct
{
  __IO uint32_t CTRL;       /*!< PWC Power control register,                  Address offset: 0x00 */
  __IO uint32_t CTRLSTS;    /*!< PWC Power control/status register,           Address offset: 0x04 */
} PWC_TypeDef;

/**
  * @brief Real-Time Clock
  */

typedef struct
{
  __IO uint32_t CTRLH;      /*!< RTC control register high,                   Address offset: 0x00 */
  __IO uint32_t CTRLL;      /*!< RTC control register low,                    Address offset: 0x04 */
  __IO uint32_t DIVH;       /*!< RTC divider register high,                   Address offset: 0x08 */
  __IO uint32_t DIVL;       /*!< RTC divider register low,                    Address offset: 0x0C */
  __IO uint32_t DIVCNTH;    /*!< RTC divider counter register high,           Address offset: 0x10 */
  __IO uint32_t DIVCNTL;    /*!< RTC divider counter register low,            Address offset: 0x14 */
  __IO uint32_t CNTH;       /*!< RTC counter value register high,             Address offset: 0x18 */
  __IO uint32_t CNTL;       /*!< RTC counter value register low,              Address offset: 0x1C */
  __IO uint32_t TAH;        /*!< RTC alarm register high,                     Address offset: 0x20 */
  __IO uint32_t TAL;        /*!< RTC alarm register low,                      Address offset: 0x24 */
} RTC_TypeDef;

/**
  * @brief SD Host Interface
  */

typedef struct
{
  __IO uint32_t PWRCTRL;          /*!< SDIO power control register,                 Address offset: 0x00        */
  __IO uint32_t CLKCTRL;          /*!< SDIO clock control register,                 Address offset: 0x04        */
  __IO uint32_t ARG;              /*!< SDIO argument register,                      Address offset: 0x08        */
  __IO uint32_t CMD;              /*!< SDIO command register,                       Address offset: 0x0C        */
  __I  uint32_t RSPCMD;           /*!< SDIO command response register,              Address offset: 0x10        */
  __I  uint32_t RSP1;             /*!< SDIO response register 1,                    Address offset: 0x14        */
  __I  uint32_t RSP2;             /*!< SDIO response register 2,                    Address offset: 0x18        */
  __I  uint32_t RSP3;             /*!< SDIO response register 3,                    Address offset: 0x1C        */
  __I  uint32_t RSP4;             /*!< SDIO response register 4,                    Address offset: 0x20        */
  __IO uint32_t DTTMR;            /*!< SDIO data timer register,                    Address offset: 0x24        */
  __IO uint32_t DTLEN;            /*!< SDIO data length register,                   Address offset: 0x28        */
  __IO uint32_t DTCTRL;           /*!< SDIO data control register,                  Address offset: 0x2C        */
  __I  uint32_t DTCNTR;           /*!< SDIO data counter register,                  Address offset: 0x30        */
  __I  uint32_t STS;              /*!< SDIO status register,                        Address offset: 0x34        */
  __IO uint32_t INTCLR;           /*!< SDIO clear interrupt register,               Address offset: 0x38        */
  __IO uint32_t INTEN;            /*!< SDIO interrupt mask register,                Address offset: 0x3C        */
  uint32_t      RESERVED0[2];     /*!< Reserved,                                    Address offset: 0x40 ~ 0x44 */
  __I  uint32_t BUFCNTR;          /*!< SDIO BUF counter register,                   Address offset: 0x48        */
  uint32_t      RESERVED1[13];    /*!< Reserved,                                    Address offset: 0x4C ~ 0x7C */
  __IO uint32_t BUF;              /*!< SDIO data BUF register,                      Address offset: 0x80        */
} SDIO_TypeDef;

/**
  * @brief Serial Peripheral Interface
  */

typedef struct
{
  __IO uint32_t CTRL1;      /*!< SPI control register 1,                      Address offset: 0x00 */
  __IO uint32_t CTRL2;      /*!< SPI control register 2,                      Address offset: 0x04 */
  __IO uint32_t STS;        /*!< SPI status register,                         Address offset: 0x08 */
  __IO uint32_t DT;         /*!< SPI data register,                           Address offset: 0x0C */
  __IO uint32_t CPOLY;      /*!< SPI CRC register,                            Address offset: 0x10 */
  __IO uint32_t RCRC;       /*!< SPI RX CRC register,                         Address offset: 0x14 */
  __IO uint32_t TCRC;       /*!< SPI TX CRC register,                         Address offset: 0x18 */
  __IO uint32_t I2SCTRL;    /*!< SPI_I2S register,                            Address offset: 0x1C */
  __IO uint32_t I2SCLKP;    /*!< SPI_I2S prescaler register,                  Address offset: 0x20 */
} SPI_TypeDef;

/**
  * @brief TMR Timers
  */

typedef struct
{
  __IO uint32_t CTRL1;      /*!< TMR control register 1,                      Address offset: 0x00 */
  __IO uint32_t CTRL2;      /*!< TMR control register 2,                      Address offset: 0x04 */
  __IO uint32_t STCTRL;     /*!< TMR slave timer control register,            Address offset: 0x08 */
  __IO uint32_t IDEN;       /*!< TMR DMA/interrupt enable register,           Address offset: 0x0C */
  __IO uint32_t ISTS;       /*!< TMR interrupt status register,               Address offset: 0x10 */
  __IO uint32_t SWEVT;      /*!< TMR Software event register,                 Address offset: 0x14 */
  __IO uint32_t CM1;        /*!< TMR channel mode register 1,                 Address offset: 0x18 */
  __IO uint32_t CM2;        /*!< TMR channel mode register 2,                 Address offset: 0x1C */
  __IO uint32_t CCTRL;      /*!< TMR Channel control register,                Address offset: 0x20 */
  __IO uint32_t CVAL;       /*!< TMR counter value,                           Address offset: 0x24 */
  __IO uint32_t DIV;        /*!< TMR division value,                          Address offset: 0x28 */
  __IO uint32_t PR;         /*!< TMR period register,                         Address offset: 0x2C */
  __IO uint32_t RPR;        /*!< TMR repetition period register,              Address offset: 0x30 */
  __IO uint32_t C1DT;       /*!< TMR channel 1 data register,                 Address offset: 0x34 */
  __IO uint32_t C2DT;       /*!< TMR channel 2 data register,                 Address offset: 0x38 */
  __IO uint32_t C3DT;       /*!< TMR channel 3 data register,                 Address offset: 0x3C */
  __IO uint32_t C4DT;       /*!< TMR channel 4 data register,                 Address offset: 0x40 */
  __IO uint32_t BRK;        /*!< TMR break register,                          Address offset: 0x44 */
  __IO uint32_t DMACTRL;    /*!< TMR DMA control register,                    Address offset: 0x48 */
  __IO uint32_t DMADT;      /*!< TMR DMA data register,                       Address offset: 0x4C */
}TMR_TypeDef;

/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */

typedef struct
{
  __IO uint32_t STS;      /*!< USART Status register,                       Address offset: 0x00 */
  __IO uint32_t DT;       /*!< USART Data register,                         Address offset: 0x04 */
  __IO uint32_t BAUDR;    /*!< USART Baud rate register,                    Address offset: 0x08 */
  __IO uint32_t CTRL1;    /*!< USART Control register 1,                    Address offset: 0x0C */
  __IO uint32_t CTRL2;    /*!< USART Control register 2,                    Address offset: 0x10 */
  __IO uint32_t CTRL3;    /*!< USART Control register 3,                    Address offset: 0x14 */
  __IO uint32_t GDIV;     /*!< USART Guard time and divider register,       Address offset: 0x18 */
} USART_TypeDef;

/**
  * @brief Universal Serial Bus Full Speed Device
  */

typedef struct
{
  __IO uint32_t EPT[8];          /*!< USBFS endpoint 0 ~ 7 register,               Address offset: 0x00 ~ 0x1C */
  uint32_t      RESERVED0[8];    /*!< Reserved,                                    Address offset: 0x20 ~ 0x3C */
  __IO uint32_t CTRL;            /*!< USBFS control register,                      Address offset: 0x40        */
  __IO uint32_t INTSTS;          /*!< USBFS interrupt status register,             Address offset: 0x44        */
  __IO uint32_t SOFRNUM;         /*!< USBFS SOF frame number register,             Address offset: 0x48        */
  __IO uint32_t DEVADDR;         /*!< USBFS device address register,               Address offset: 0x4C        */
  __IO uint32_t BUFTBL;          /*!< USBFS buffer table address register,         Address offset: 0x50        */
  uint32_t      RESERVED1[3];    /*!< Reserved,                                    Address offset: 0x54 ~ 0x5C */
  __IO uint32_t CFG;             /*!< USBFS CFG control register,                  Address offset: 0x60        */
} USB_TypeDef;

/**
  * @brief WATCHDOG Timer
  */

typedef struct
{
  __IO uint32_t CMD;    /*!< WDT Command register,                        Address offset: 0x00 */
  __IO uint32_t DIV;    /*!< WDT Divider register,                        Address offset: 0x04 */
  __IO uint32_t RLD;    /*!< WDT Reload register,                         Address offset: 0x08 */
  __IO uint32_t STS;    /*!< WDT Status register,                         Address offset: 0x0C */
} WDT_TypeDef;

/**
  * @brief Window WATCHDOG Timer
  */

typedef struct
{
  __IO uint32_t CTRL;    /*!< WWDT Control register,                       Address offset: 0x00 */
  __IO uint32_t CFG;     /*!< WWDT Configuration register,                 Address offset: 0x04 */
  __IO uint32_t STS;     /*!< WWDT Status register,                        Address offset: 0x08 */
} WWDT_TypeDef;

/**
  * @brief External Memory Controller Bank 1 Control and Timing
  */

typedef struct
{
  __IO uint32_t BK1CTRL;    /*!< XMC SRAM/NOR Flash chip select control reg,  Address offset: 0x00 + 0x08 * (x - 1) x = 1 or 4 */
  __IO uint32_t BK1TMG;     /*!< XMC SRAM/NOR Flash chip select timing reg,   Address offset: 0x04 + 0x08 * (x - 1) x = 1 or 4 */
} XMC_Bank1ControlTiming_TypeDef;

/**
  * @brief External Memory Controller Bank 1 Write Timing
  */

typedef struct
{
  __IO uint32_t BK1TMGWR;    /*!< XMC SRAM/NOR Flash write timing registers,   Address offset: 0x104 + 0x08 * (x - 1) x = 1 or 4 */
  uint32_t      RESERVED;    /*!< Reserved                                                                                       */
} XMC_Bank1WriteTiming_TypeDef;

/**
  * @brief External Memory Controller Bank 1
  */

typedef struct
{
  XMC_Bank1ControlTiming_TypeDef sBank1ControlTiming[4];    /*!< XMC Bank 1 Control and Timing registers,     Address offset: 0x000 ~ 0x01C */
  uint32_t      RESERVED0[57];                              /*!< Reserved,                                    Address offset: 0x020 ~ 0x100 */
  XMC_Bank1WriteTiming_TypeDef sBank1WriteTiming[4];        /*!< XMC Bank 1 Write Timing registers,           Address offset: 0x104 ~ 0x11C */
  uint32_t      RESERVED1[63];                              /*!< Reserved,                                    Address offset: 0x120 ~ 0x21C */
  __IO uint32_t EXT[4];                                     /*!< XMC SRAM/NOR Flash extra timing registers,   Address offset: 0x220 ~ 0x22C */
} XMC_Bank1_TypeDef;

/**
  * @brief External Memory Controller Bank 2
  */

typedef struct
{
  __IO uint32_t BK2CTRL;     /*!< XMC NAND Flash control register 2,           Address offset: 0x60 */
  __IO uint32_t BK2IS;       /*!< XMC NAND INT enable and FIFO status reg 2,   Address offset: 0x64 */
  __IO uint32_t BK2TMGRG;    /*!< XMC NAND Flash Regular memory timing reg 2,  Address offset: 0x68 */
  __IO uint32_t BK2TMGSP;    /*!< XMC NAND Flash Special memory timing reg 2,  Address offset: 0x6C */
  uint32_t      RESERVED;    /*!< Reserved,                                    Address offset: 0x70 */
  __IO uint32_t BK2ECC;      /*!< XMC NAND Flash ECC value register 2,         Address offset: 0x74 */
} XMC_Bank2_TypeDef;

/**
  * @}
  */

/** @addtogroup Peripheral_memory_map
  * @{
  */

#define FLASH_BASE            0x08000000U                     /*!< FLASH base address in the alias region         */
#define FLASH_BANK1_END       0x0807FFFFU                     /*!< FLASH end address of bank 1                    */
#define FLASH_BANK2_END       0x080FFFFFU                     /*!< FLASH end address of bank 2                    */
#define SPIM_FLASH_BASE       0x08400000U                     /*!< FLASH External memory base address             */
#define SPIM_FLASH_END        0x093FFFFFU                     /*!< FLASH External memory end address              */
#define SRAM_BASE             0x20000000U                     /*!< SRAM base address in the alias region          */
#define PERIPH_BASE           0x40000000U                     /*!< Peripheral base address in the alias region    */

#define SRAM_BB_BASE          0x22000000U                     /*!< SRAM base address in the bit-band region       */
#define PERIPH_BB_BASE        0x42000000U                     /*!< Peripheral base address in the bit-band region */

#define XMC_BASE              0x60000000U                     /*!< XMC base address */
#define XMC_R_BASE            0xA0000000U                     /*!< XMC registers base address */

/*!< Peripheral memory map */
#define APB1PERIPH_BASE       PERIPH_BASE                     /*!< APB1 base address                              */
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000U)     /*!< APB2 base address                              */
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x00020000U)     /*!< AHB base address                               */

