HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axg.h
/******************  Bit definition for FLASH_EPP1 register  ******************/
#define FLASH_EPP1_EPP1_Pos                 (16U)
#define FLASH_EPP1_EPP1_Msk                 (0xFFU << FLASH_EPP1_EPP1_Pos)          /*!< 0x00FF0000 */
#define FLASH_EPP1_EPP1                     FLASH_EPP1_EPP1_Msk                     /*!< Flash erase/write protection byte 1 */
#define FLASH_EPP1_nEPP1_Pos                (24U)
#define FLASH_EPP1_nEPP1_Msk                (0xFFU << FLASH_EPP1_nEPP1_Pos)         /*!< 0xFF000000 */
#define FLASH_EPP1_nEPP1                    FLASH_EPP1_nEPP1_Msk                    /*!< Inverse code of flash erase/write protection byte 1 */

/******************  Bit definition for FLASH_EPP2 register  ******************/
#define FLASH_EPP2_EPP2_Pos                 (0U)
#define FLASH_EPP2_EPP2_Msk                 (0xFFU << FLASH_EPP2_EPP2_Pos)          /*!< 0x000000FF */
#define FLASH_EPP2_EPP2                     FLASH_EPP2_EPP2_Msk                     /*!< Flash erase/write protection byte 2 */
#define FLASH_EPP2_nEPP2_Pos                (8U)
#define FLASH_EPP2_nEPP2_Msk                (0xFFU << FLASH_EPP2_nEPP2_Pos)         /*!< 0x0000FF00 */
#define FLASH_EPP2_nEPP2                    FLASH_EPP2_nEPP2_Msk                    /*!< Inverse code of flash erase/write protection byte 2 */

/******************  Bit definition for FLASH_EPP3 register  ******************/
#define FLASH_EPP3_EPP3_Pos                 (16U)
#define FLASH_EPP3_EPP3_Msk                 (0xFFU << FLASH_EPP3_EPP3_Pos)          /*!< 0x00FF0000 */
#define FLASH_EPP3_EPP3                     FLASH_EPP3_EPP3_Msk                     /*!< Flash erase/write protection byte 3 */
#define FLASH_EPP3_nEPP3_Pos                (24U)
#define FLASH_EPP3_nEPP3_Msk                (0xFFU << FLASH_EPP3_nEPP3_Pos)         /*!< 0xFF000000 */
#define FLASH_EPP3_nEPP3                    FLASH_EPP3_nEPP3_Msk                    /*!< Inverse code of flash erase/write protection byte 3 */

/*****************  Bit definition for FLASH_EOPB0 register  ******************/
#define FLASH_EOPB0_EOPB0_Pos               (0U)
#define FLASH_EOPB0_EOPB0_Msk               (0xFFU << FLASH_EOPB0_EOPB0_Pos)        /*!< 0x000000FF */
#define FLASH_EOPB0_EOPB0                   FLASH_EOPB0_EOPB0_Msk                   /*!< Extended system options */
#define FLASH_EOPB0_nEOPB0_Pos              (8U)
#define FLASH_EOPB0_nEOPB0_Msk              (0xFFU << FLASH_EOPB0_nEOPB0_Pos)       /*!< 0x0000FF00 */
#define FLASH_EOPB0_nEOPB0                  FLASH_EOPB0_nEOPB0_Msk                  /*!< Inverse code of extended system options */

/******************  Bit definition for FLASH_DATA2 register  *****************/
#define FLASH_DATA2_DATA2_Pos               (0U)
#define FLASH_DATA2_DATA2_Msk               (0xFFU << FLASH_DATA2_DATA2_Pos)        /*!< 0x000000FF */
#define FLASH_DATA2_DATA2                   FLASH_DATA2_DATA2_Msk                   /*!< User data 2 */
#define FLASH_DATA2_nDATA2_Pos              (8U)
#define FLASH_DATA2_nDATA2_Msk              (0xFFU << FLASH_DATA2_nDATA2_Pos)       /*!< 0x0000FF00 */
#define FLASH_DATA2_nDATA2                  FLASH_DATA2_nDATA2_Msk                  /*!< Inverse code of user data 2 */

/******************  Bit definition for FLASH_DATA3 register  *****************/
#define FLASH_DATA3_DATA3_Pos               (16U)
#define FLASH_DATA3_DATA3_Msk               (0xFFU << FLASH_DATA3_DATA3_Pos)        /*!< 0x00FF0000 */
#define FLASH_DATA3_DATA3                   FLASH_DATA3_DATA3_Msk                   /*!< User data 3 */
#define FLASH_DATA3_nDATA3_Pos              (24U)
#define FLASH_DATA3_nDATA3_Msk              (0xFFU << FLASH_DATA3_nDATA3_Pos)       /*!< 0xFF000000 */
#define FLASH_DATA3_nDATA3                  FLASH_DATA3_nDATA3_Msk                  /*!< Inverse code of user data 3 */

/******************  Bit definition for FLASH_DATA4 register  *****************/
#define FLASH_DATA4_DATA4_Pos               (0U)
#define FLASH_DATA4_DATA4_Msk               (0xFFU << FLASH_DATA4_DATA4_Pos)        /*!< 0x000000FF */
#define FLASH_DATA4_DATA4                   FLASH_DATA4_DATA4_Msk                   /*!< User data 4 */
#define FLASH_DATA4_nDATA4_Pos              (8U)
#define FLASH_DATA4_nDATA4_Msk              (0xFFU << FLASH_DATA4_nDATA4_Pos)       /*!< 0x0000FF00 */
#define FLASH_DATA4_nDATA4                  FLASH_DATA4_nDATA4_Msk                  /*!< Inverse code of user data 4 */

/******************  Bit definition for FLASH_DATA5 register  *****************/
#define FLASH_DATA5_DATA5_Pos               (16U)
#define FLASH_DATA5_DATA5_Msk               (0xFFU << FLASH_DATA5_DATA5_Pos)        /*!< 0x00FF0000 */
#define FLASH_DATA5_DATA5                   FLASH_DATA5_DATA5_Msk                   /*!< User data 5 */
#define FLASH_DATA5_nDATA5_Pos              (24U)
#define FLASH_DATA5_nDATA5_Msk              (0xFFU << FLASH_DATA5_nDATA5_Pos)       /*!< 0xFF000000 */
#define FLASH_DATA5_nDATA5                  FLASH_DATA5_nDATA5_Msk                  /*!< Inverse code of user data 5 */

/******************  Bit definition for FLASH_DATA6 register  *****************/
#define FLASH_DATA6_DATA6_Pos               (0U)
#define FLASH_DATA6_DATA6_Msk               (0xFFU << FLASH_DATA6_DATA6_Pos)        /*!< 0x000000FF */
#define FLASH_DATA6_DATA6                   FLASH_DATA6_DATA6_Msk                   /*!< User data 6 */
#define FLASH_DATA6_nDATA6_Pos              (8U)
#define FLASH_DATA6_nDATA6_Msk              (0xFFU << FLASH_DATA6_nDATA6_Pos)       /*!< 0x0000FF00 */
#define FLASH_DATA6_nDATA6                  FLASH_DATA6_nDATA6_Msk                  /*!< Inverse code of user data 6 */

/******************  Bit definition for FLASH_DATA7 register  *****************/
#define FLASH_DATA7_DATA7_Pos               (16U)
#define FLASH_DATA7_DATA7_Msk               (0xFFU << FLASH_DATA7_DATA7_Pos)        /*!< 0x00FF0000 */
#define FLASH_DATA7_DATA7                   FLASH_DATA7_DATA7_Msk                   /*!< User data 7 */
#define FLASH_DATA7_nDATA7_Pos              (24U)
#define FLASH_DATA7_nDATA7_Msk              (0xFFU << FLASH_DATA7_nDATA7_Pos)       /*!< 0xFF000000 */
#define FLASH_DATA7_nDATA7                  FLASH_DATA7_nDATA7_Msk                  /*!< Inverse code of user data 7 */

/*************  Bit definition for FLASH_EXT_FLASH_KEY0 register  *************/
#define FLASH_EXT_FLASH_KEY0_EXT_FLASH_KEY0_Pos   (0U)                                        /*!< 0x000000FF */
#define FLASH_EXT_FLASH_KEY0_EXT_FLASH_KEY0_Msk   (0xFFU << FLASH_EXT_FLASH_KEY0_EXT_FLASH_KEY0_Pos)
#define FLASH_EXT_FLASH_KEY0_EXT_FLASH_KEY0       FLASH_EXT_FLASH_KEY0_EXT_FLASH_KEY0_Msk     /*!< External memory ciphertext encryption key byte 0 */
#define FLASH_EXT_FLASH_KEY0_nEXT_FLASH_KEY0_Pos  (8U)                                        /*!< 0x0000FF00 */
#define FLASH_EXT_FLASH_KEY0_nEXT_FLASH_KEY0_Msk  (0xFFU << FLASH_EXT_FLASH_KEY0_nEXT_FLASH_KEY0_Pos)
#define FLASH_EXT_FLASH_KEY0_nEXT_FLASH_KEY0      FLASH_EXT_FLASH_KEY0_nEXT_FLASH_KEY0_Msk    /*!< Inverse code of external memory ciphertext encryption key byte 0 */

