HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axg.h
#define GPIO_CFGLR_IOFC7_Pos                (30U)
#define GPIO_CFGLR_IOFC7_Msk                (0x3U << GPIO_CFGLR_IOFC7_Pos)          /*!< 0xC0000000 */
#define GPIO_CFGLR_IOFC7                    GPIO_CFGLR_IOFC7_Msk                    /*!< IOFC7[1:0] bits (GPIO x function configuration, pin 7) */
#define GPIO_CFGLR_IOFC7_0                  (0x1U << GPIO_CFGLR_IOFC7_Pos)          /*!< 0x40000000 */
#define GPIO_CFGLR_IOFC7_1                  (0x2U << GPIO_CFGLR_IOFC7_Pos)          /*!< 0x80000000 */

/******************  Bit definition for GPIO_CFGHR register  ******************/
#define GPIO_CFGHR_IOMC_Pos                 (0U)
#define GPIO_CFGHR_IOMC_Msk                 (0x33333333U << GPIO_CFGHR_IOMC_Pos)    /*!< 0x33333333 */
#define GPIO_CFGHR_IOMC                     GPIO_CFGHR_IOMC_Msk                     /*!< GPIO x mode configuration */

#define GPIO_CFGHR_IOMC8_Pos                (0U)
#define GPIO_CFGHR_IOMC8_Msk                (0x3U << GPIO_CFGHR_IOMC8_Pos)          /*!< 0x00000003 */
#define GPIO_CFGHR_IOMC8                    GPIO_CFGHR_IOMC8_Msk                    /*!< IOMC8[1:0] bits (GPIO x mode configuration, pin 8) */
#define GPIO_CFGHR_IOMC8_0                  (0x1U << GPIO_CFGHR_IOMC8_Pos)          /*!< 0x00000001 */
#define GPIO_CFGHR_IOMC8_1                  (0x2U << GPIO_CFGHR_IOMC8_Pos)          /*!< 0x00000002 */

#define GPIO_CFGHR_IOMC9_Pos                (4U)
#define GPIO_CFGHR_IOMC9_Msk                (0x3U << GPIO_CFGHR_IOMC9_Pos)          /*!< 0x00000030 */
#define GPIO_CFGHR_IOMC9                    GPIO_CFGHR_IOMC9_Msk                    /*!< IOMC9[1:0] bits (GPIO x mode configuration, pin 9) */
#define GPIO_CFGHR_IOMC9_0                  (0x1U << GPIO_CFGHR_IOMC9_Pos)          /*!< 0x00000010 */
#define GPIO_CFGHR_IOMC9_1                  (0x2U << GPIO_CFGHR_IOMC9_Pos)          /*!< 0x00000020 */

#define GPIO_CFGHR_IOMC10_Pos               (8U)
#define GPIO_CFGHR_IOMC10_Msk               (0x3U << GPIO_CFGHR_IOMC10_Pos)         /*!< 0x00000300 */
#define GPIO_CFGHR_IOMC10                   GPIO_CFGHR_IOMC10_Msk                   /*!< IOMC10[1:0] bits (GPIO x mode configuration, pin 10) */
#define GPIO_CFGHR_IOMC10_0                 (0x1U << GPIO_CFGHR_IOMC10_Pos)         /*!< 0x00000100 */
#define GPIO_CFGHR_IOMC10_1                 (0x2U << GPIO_CFGHR_IOMC10_Pos)         /*!< 0x00000200 */

#define GPIO_CFGHR_IOMC11_Pos               (12U)
#define GPIO_CFGHR_IOMC11_Msk               (0x3U << GPIO_CFGHR_IOMC11_Pos)         /*!< 0x00003000 */
#define GPIO_CFGHR_IOMC11                   GPIO_CFGHR_IOMC11_Msk                   /*!< IOMC11[1:0] bits (GPIO x mode configuration, pin 11) */
#define GPIO_CFGHR_IOMC11_0                 (0x1U << GPIO_CFGHR_IOMC11_Pos)         /*!< 0x00001000 */
#define GPIO_CFGHR_IOMC11_1                 (0x2U << GPIO_CFGHR_IOMC11_Pos)         /*!< 0x00002000 */

#define GPIO_CFGHR_IOMC12_Pos               (16U)
#define GPIO_CFGHR_IOMC12_Msk               (0x3U << GPIO_CFGHR_IOMC12_Pos)         /*!< 0x00030000 */
#define GPIO_CFGHR_IOMC12                   GPIO_CFGHR_IOMC12_Msk                   /*!< IOMC12[1:0] bits (GPIO x mode configuration, pin 12) */
#define GPIO_CFGHR_IOMC12_0                 (0x1U << GPIO_CFGHR_IOMC12_Pos)         /*!< 0x00010000 */
#define GPIO_CFGHR_IOMC12_1                 (0x2U << GPIO_CFGHR_IOMC12_Pos)         /*!< 0x00020000 */

#define GPIO_CFGHR_IOMC13_Pos               (20U)
#define GPIO_CFGHR_IOMC13_Msk               (0x3U << GPIO_CFGHR_IOMC13_Pos)         /*!< 0x00300000 */
#define GPIO_CFGHR_IOMC13                   GPIO_CFGHR_IOMC13_Msk                   /*!< IOMC13[1:0] bits (GPIO x mode configuration, pin 13) */
#define GPIO_CFGHR_IOMC13_0                 (0x1U << GPIO_CFGHR_IOMC13_Pos)         /*!< 0x00100000 */
#define GPIO_CFGHR_IOMC13_1                 (0x2U << GPIO_CFGHR_IOMC13_Pos)         /*!< 0x00200000 */

#define GPIO_CFGHR_IOMC14_Pos               (24U)
#define GPIO_CFGHR_IOMC14_Msk               (0x3U << GPIO_CFGHR_IOMC14_Pos)         /*!< 0x03000000 */
#define GPIO_CFGHR_IOMC14                   GPIO_CFGHR_IOMC14_Msk                   /*!< IOMC14[1:0] bits (GPIO x mode configuration, pin 14) */
#define GPIO_CFGHR_IOMC14_0                 (0x1U << GPIO_CFGHR_IOMC14_Pos)         /*!< 0x01000000 */
#define GPIO_CFGHR_IOMC14_1                 (0x2U << GPIO_CFGHR_IOMC14_Pos)         /*!< 0x02000000 */

#define GPIO_CFGHR_IOMC15_Pos               (28U)
#define GPIO_CFGHR_IOMC15_Msk               (0x3U << GPIO_CFGHR_IOMC15_Pos)         /*!< 0x30000000 */
#define GPIO_CFGHR_IOMC15                   GPIO_CFGHR_IOMC15_Msk                   /*!< IOMC15[1:0] bits (GPIO x mode configuration, pin 15) */
#define GPIO_CFGHR_IOMC15_0                 (0x1U << GPIO_CFGHR_IOMC15_Pos)         /*!< 0x10000000 */
#define GPIO_CFGHR_IOMC15_1                 (0x2U << GPIO_CFGHR_IOMC15_Pos)         /*!< 0x20000000 */

#define GPIO_CFGHR_IOFC_Pos                 (2U)
#define GPIO_CFGHR_IOFC_Msk                 (0x33333333U << GPIO_CRH_CNF_Pos)       /*!< 0xCCCCCCCC */
#define GPIO_CFGHR_IOFC                     GPIO_CRH_CNF_Msk                        /*!< GPIO x function configuration */

#define GPIO_CFGHR_IOFC8_Pos                (2U)
#define GPIO_CFGHR_IOFC8_Msk                (0x3U << GPIO_CFGHR_IOFC8_Pos)          /*!< 0x0000000C */
#define GPIO_CFGHR_IOFC8                    GPIO_CFGHR_IOFC8_Msk                    /*!< IOFC8[1:0] bits (GPIO x function configuration, pin 8) */
#define GPIO_CFGHR_IOFC8_0                  (0x1U << GPIO_CFGHR_IOFC8_Pos)          /*!< 0x00000004 */
#define GPIO_CFGHR_IOFC8_1                  (0x2U << GPIO_CFGHR_IOFC8_Pos)          /*!< 0x00000008 */

#define GPIO_CFGHR_IOFC9_Pos                (6U)
#define GPIO_CFGHR_IOFC9_Msk                (0x3U << GPIO_CFGHR_IOFC9_Pos)          /*!< 0x000000C0 */
#define GPIO_CFGHR_IOFC9                    GPIO_CFGHR_IOFC9_Msk                    /*!< IOFC9[1:0] bits (GPIO x function configuration, pin 9) */
#define GPIO_CFGHR_IOFC9_0                  (0x1U << GPIO_CFGHR_IOFC9_Pos)          /*!< 0x00000040 */
#define GPIO_CFGHR_IOFC9_1                  (0x2U << GPIO_CFGHR_IOFC9_Pos)          /*!< 0x00000080 */

#define GPIO_CFGHR_IOFC10_Pos               (10U)
#define GPIO_CFGHR_IOFC10_Msk               (0x3U << GPIO_CFGHR_IOFC10_Pos)         /*!< 0x00000C00 */
#define GPIO_CFGHR_IOFC10                   GPIO_CFGHR_IOFC10_Msk                   /*!< IOFC10[1:0] bits (GPIO x function configuration, pin 10) */
#define GPIO_CFGHR_IOFC10_0                 (0x1U << GPIO_CFGHR_IOFC10_Pos)         /*!< 0x00000400 */
#define GPIO_CFGHR_IOFC10_1                 (0x2U << GPIO_CFGHR_IOFC10_Pos)         /*!< 0x00000800 */

