HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axg.h
#define GPIO_CFGHR_IOFC11_Pos               (14U)
#define GPIO_CFGHR_IOFC11_Msk               (0x3U << GPIO_CFGHR_IOFC11_Pos)         /*!< 0x0000C000 */
#define GPIO_CFGHR_IOFC11                   GPIO_CFGHR_IOFC11_Msk                   /*!< IOFC11[1:0] bits (GPIO x function configuration, pin 11) */
#define GPIO_CFGHR_IOFC11_0                 (0x1U << GPIO_CFGHR_IOFC11_Pos)         /*!< 0x00004000 */
#define GPIO_CFGHR_IOFC11_1                 (0x2U << GPIO_CFGHR_IOFC11_Pos)         /*!< 0x00008000 */

#define GPIO_CFGHR_IOFC12_Pos               (18U)
#define GPIO_CFGHR_IOFC12_Msk               (0x3U << GPIO_CFGHR_IOFC12_Pos)         /*!< 0x000C0000 */
#define GPIO_CFGHR_IOFC12                   GPIO_CFGHR_IOFC12_Msk                   /*!< IOFC12[1:0] bits (GPIO x function configuration, pin 12) */
#define GPIO_CFGHR_IOFC12_0                 (0x1U << GPIO_CFGHR_IOFC12_Pos)         /*!< 0x00040000 */
#define GPIO_CFGHR_IOFC12_1                 (0x2U << GPIO_CFGHR_IOFC12_Pos)         /*!< 0x00080000 */

#define GPIO_CFGHR_IOFC13_Pos               (22U)
#define GPIO_CFGHR_IOFC13_Msk               (0x3U << GPIO_CFGHR_IOFC13_Pos)         /*!< 0x00C00000 */
#define GPIO_CFGHR_IOFC13                   GPIO_CFGHR_IOFC13_Msk                   /*!< IOFC13[1:0] bits (GPIO x function configuration, pin 13) */
#define GPIO_CFGHR_IOFC13_0                 (0x1U << GPIO_CFGHR_IOFC13_Pos)         /*!< 0x00400000 */
#define GPIO_CFGHR_IOFC13_1                 (0x2U << GPIO_CFGHR_IOFC13_Pos)         /*!< 0x00800000 */

#define GPIO_CFGHR_IOFC14_Pos               (26U)
#define GPIO_CFGHR_IOFC14_Msk               (0x3U << GPIO_CFGHR_IOFC14_Pos)         /*!< 0x0C000000 */
#define GPIO_CFGHR_IOFC14                   GPIO_CFGHR_IOFC14_Msk                   /*!< IOFC14[1:0] bits (GPIO x function configuration, pin 14) */
#define GPIO_CFGHR_IOFC14_0                 (0x1U << GPIO_CFGHR_IOFC14_Pos)         /*!< 0x04000000 */
#define GPIO_CFGHR_IOFC14_1                 (0x2U << GPIO_CFGHR_IOFC14_Pos)         /*!< 0x08000000 */

#define GPIO_CFGHR_IOFC15_Pos               (30U)
#define GPIO_CFGHR_IOFC15_Msk               (0x3U << GPIO_CFGHR_IOFC15_Pos)         /*!< 0xC0000000 */
#define GPIO_CFGHR_IOFC15                   GPIO_CFGHR_IOFC15_Msk                   /*!< IOFC15[1:0] bits (GPIO x function configuration, pin 15) */
#define GPIO_CFGHR_IOFC15_0                 (0x1U << GPIO_CFGHR_IOFC15_Pos)         /*!< 0x40000000 */
#define GPIO_CFGHR_IOFC15_1                 (0x2U << GPIO_CFGHR_IOFC15_Pos)         /*!< 0x80000000 */

/*!<****************  Bit definition for GPIO_IDT register  *******************/
#define GPIO_IDT_IDT0_Pos                   (0U)
#define GPIO_IDT_IDT0_Msk                   (0x1U << GPIO_IDT_IDT0_Pos)             /*!< 0x00000001 */
#define GPIO_IDT_IDT0                       GPIO_IDT_IDT0_Msk                       /*!< GPIO x input data, bit 0 */
#define GPIO_IDT_IDT1_Pos                   (1U)
#define GPIO_IDT_IDT1_Msk                   (0x1U << GPIO_IDT_IDT1_Pos)             /*!< 0x00000002 */
#define GPIO_IDT_IDT1                       GPIO_IDT_IDT1_Msk                       /*!< GPIO x input data, bit 1 */
#define GPIO_IDT_IDT2_Pos                   (2U)
#define GPIO_IDT_IDT2_Msk                   (0x1U << GPIO_IDT_IDT2_Pos)             /*!< 0x00000004 */
#define GPIO_IDT_IDT2                       GPIO_IDT_IDT2_Msk                       /*!< GPIO x input data, bit 2 */
#define GPIO_IDT_IDT3_Pos                   (3U)
#define GPIO_IDT_IDT3_Msk                   (0x1U << GPIO_IDT_IDT3_Pos)             /*!< 0x00000008 */
#define GPIO_IDT_IDT3                       GPIO_IDT_IDT3_Msk                       /*!< GPIO x input data, bit 3 */
#define GPIO_IDT_IDT4_Pos                   (4U)
#define GPIO_IDT_IDT4_Msk                   (0x1U << GPIO_IDT_IDT4_Pos)             /*!< 0x00000010 */
#define GPIO_IDT_IDT4                       GPIO_IDT_IDT4_Msk                       /*!< GPIO x input data, bit 4 */
#define GPIO_IDT_IDT5_Pos                   (5U)
#define GPIO_IDT_IDT5_Msk                   (0x1U << GPIO_IDT_IDT5_Pos)             /*!< 0x00000020 */
#define GPIO_IDT_IDT5                       GPIO_IDT_IDT5_Msk                       /*!< GPIO x input data, bit 5 */
#define GPIO_IDT_IDT6_Pos                   (6U)
#define GPIO_IDT_IDT6_Msk                   (0x1U << GPIO_IDT_IDT6_Pos)             /*!< 0x00000040 */
#define GPIO_IDT_IDT6                       GPIO_IDT_IDT6_Msk                       /*!< GPIO x input data, bit 6 */
#define GPIO_IDT_IDT7_Pos                   (7U)
#define GPIO_IDT_IDT7_Msk                   (0x1U << GPIO_IDT_IDT7_Pos)             /*!< 0x00000080 */
#define GPIO_IDT_IDT7                       GPIO_IDT_IDT7_Msk                       /*!< GPIO x input data, bit 7 */
#define GPIO_IDT_IDT8_Pos                   (8U)
#define GPIO_IDT_IDT8_Msk                   (0x1U << GPIO_IDT_IDT8_Pos)             /*!< 0x00000100 */
#define GPIO_IDT_IDT8                       GPIO_IDT_IDT8_Msk                       /*!< GPIO x input data, bit 8 */
#define GPIO_IDT_IDT9_Pos                   (9U)
#define GPIO_IDT_IDT9_Msk                   (0x1U << GPIO_IDT_IDT9_Pos)             /*!< 0x00000200 */
#define GPIO_IDT_IDT9                       GPIO_IDT_IDT9_Msk                       /*!< GPIO x input data, bit 9 */
#define GPIO_IDT_IDT10_Pos                  (10U)
#define GPIO_IDT_IDT10_Msk                  (0x1U << GPIO_IDT_IDT10_Pos)            /*!< 0x00000400 */
#define GPIO_IDT_IDT10                      GPIO_IDT_IDT10_Msk                      /*!< GPIO x input data, bit 10 */
#define GPIO_IDT_IDT11_Pos                  (11U)
#define GPIO_IDT_IDT11_Msk                  (0x1U << GPIO_IDT_IDT11_Pos)            /*!< 0x00000800 */
#define GPIO_IDT_IDT11                      GPIO_IDT_IDT11_Msk                      /*!< GPIO x input data, bit 11 */
#define GPIO_IDT_IDT12_Pos                  (12U)
#define GPIO_IDT_IDT12_Msk                  (0x1U << GPIO_IDT_IDT12_Pos)            /*!< 0x00001000 */
#define GPIO_IDT_IDT12                      GPIO_IDT_IDT12_Msk                      /*!< GPIO x input data, bit 12 */
#define GPIO_IDT_IDT13_Pos                  (13U)
#define GPIO_IDT_IDT13_Msk                  (0x1U << GPIO_IDT_IDT13_Pos)            /*!< 0x00002000 */
#define GPIO_IDT_IDT13                      GPIO_IDT_IDT13_Msk                      /*!< GPIO x input data, bit 13 */
#define GPIO_IDT_IDT14_Pos                  (14U)
#define GPIO_IDT_IDT14_Msk                  (0x1U << GPIO_IDT_IDT14_Pos)            /*!< 0x00004000 */
#define GPIO_IDT_IDT14                      GPIO_IDT_IDT14_Msk                      /*!< GPIO x input data, bit 14 */
#define GPIO_IDT_IDT15_Pos                  (15U)
#define GPIO_IDT_IDT15_Msk                  (0x1U << GPIO_IDT_IDT15_Pos)            /*!< 0x00008000 */
#define GPIO_IDT_IDT15                      GPIO_IDT_IDT15_Msk                      /*!< GPIO x input data, bit 15 */

/*******************  Bit definition for GPIO_ODT register  *******************/
#define GPIO_ODT_ODT0_Pos                   (0U)
#define GPIO_ODT_ODT0_Msk                   (0x1U << GPIO_ODT_ODT0_Pos)             /*!< 0x00000001 */
#define GPIO_ODT_ODT0                       GPIO_ODT_ODT0_Msk                       /*!< GPIO x output data, bit 0 */
#define GPIO_ODT_ODT1_Pos                   (1U)
#define GPIO_ODT_ODT1_Msk                   (0x1U << GPIO_ODT_ODT1_Pos)             /*!< 0x00000002 */
#define GPIO_ODT_ODT1                       GPIO_ODT_ODT1_Msk                       /*!< GPIO x output data, bit 1 */
#define GPIO_ODT_ODT2_Pos                   (2U)
#define GPIO_ODT_ODT2_Msk                   (0x1U << GPIO_ODT_ODT2_Pos)             /*!< 0x00000004 */
#define GPIO_ODT_ODT2                       GPIO_ODT_ODT2_Msk                       /*!< GPIO x output data, bit 2 */
#define GPIO_ODT_ODT3_Pos                   (3U)
#define GPIO_ODT_ODT3_Msk                   (0x1U << GPIO_ODT_ODT3_Pos)             /*!< 0x00000008 */
#define GPIO_ODT_ODT3                       GPIO_ODT_ODT3_Msk                       /*!< GPIO x output data, bit 3 */
#define GPIO_ODT_ODT4_Pos                   (4U)
#define GPIO_ODT_ODT4_Msk                   (0x1U << GPIO_ODT_ODT4_Pos)             /*!< 0x00000010 */
#define GPIO_ODT_ODT4                       GPIO_ODT_ODT4_Msk                       /*!< GPIO x output data, bit 4 */
#define GPIO_ODT_ODT5_Pos                   (5U)
#define GPIO_ODT_ODT5_Msk                   (0x1U << GPIO_ODT_ODT5_Pos)             /*!< 0x00000020 */
#define GPIO_ODT_ODT5                       GPIO_ODT_ODT5_Msk                       /*!< GPIO x output data, bit 5 */
#define GPIO_ODT_ODT6_Pos                   (6U)
#define GPIO_ODT_ODT6_Msk                   (0x1U << GPIO_ODT_ODT6_Pos)             /*!< 0x00000040 */
#define GPIO_ODT_ODT6                       GPIO_ODT_ODT6_Msk                       /*!< GPIO x output data, bit 6 */
#define GPIO_ODT_ODT7_Pos                   (7U)
#define GPIO_ODT_ODT7_Msk                   (0x1U << GPIO_ODT_ODT7_Pos)             /*!< 0x00000080 */
#define GPIO_ODT_ODT7                       GPIO_ODT_ODT7_Msk                       /*!< GPIO x output data, bit 7 */
#define GPIO_ODT_ODT8_Pos                   (8U)
#define GPIO_ODT_ODT8_Msk                   (0x1U << GPIO_ODT_ODT8_Pos)             /*!< 0x00000100 */
#define GPIO_ODT_ODT8                       GPIO_ODT_ODT8_Msk                       /*!< GPIO x output data, bit 8 */
#define GPIO_ODT_ODT9_Pos                   (9U)
#define GPIO_ODT_ODT9_Msk                   (0x1U << GPIO_ODT_ODT9_Pos)             /*!< 0x00000200 */
#define GPIO_ODT_ODT9                       GPIO_ODT_ODT9_Msk                       /*!< GPIO x output data, bit 9 */
#define GPIO_ODT_ODT10_Pos                  (10U)
#define GPIO_ODT_ODT10_Msk                  (0x1U << GPIO_ODT_ODT10_Pos)            /*!< 0x00000400 */
#define GPIO_ODT_ODT10                      GPIO_ODT_ODT10_Msk                      /*!< GPIO x output data, bit 10 */
#define GPIO_ODT_ODT11_Pos                  (11U)
#define GPIO_ODT_ODT11_Msk                  (0x1U << GPIO_ODT_ODT11_Pos)            /*!< 0x00000800 */
#define GPIO_ODT_ODT11                      GPIO_ODT_ODT11_Msk                      /*!< GPIO x output data, bit 11 */
#define GPIO_ODT_ODT12_Pos                  (12U)
#define GPIO_ODT_ODT12_Msk                  (0x1U << GPIO_ODT_ODT12_Pos)            /*!< 0x00001000 */
#define GPIO_ODT_ODT12                      GPIO_ODT_ODT12_Msk                      /*!< GPIO x output data, bit 12 */
#define GPIO_ODT_ODT13_Pos                  (13U)
#define GPIO_ODT_ODT13_Msk                  (0x1U << GPIO_ODT_ODT13_Pos)            /*!< 0x00002000 */
#define GPIO_ODT_ODT13                      GPIO_ODT_ODT13_Msk                      /*!< GPIO x output data, bit 13 */
#define GPIO_ODT_ODT14_Pos                  (14U)
#define GPIO_ODT_ODT14_Msk                  (0x1U << GPIO_ODT_ODT14_Pos)            /*!< 0x00004000 */
#define GPIO_ODT_ODT14                      GPIO_ODT_ODT14_Msk                      /*!< GPIO x output data, bit 14 */
#define GPIO_ODT_ODT15_Pos                  (15U)
#define GPIO_ODT_ODT15_Msk                  (0x1U << GPIO_ODT_ODT15_Pos)            /*!< 0x00008000 */
#define GPIO_ODT_ODT15                      GPIO_ODT_ODT15_Msk                      /*!< GPIO x output data, bit 15 */

/*******************  Bit definition for GPIO_SCR register  *******************/
#define GPIO_SCR_IOSB0_Pos                  (0U)
#define GPIO_SCR_IOSB0_Msk                  (0x1U << GPIO_SCR_IOSB0_Pos)            /*!< 0x00000001 */
#define GPIO_SCR_IOSB0                      GPIO_SCR_IOSB0_Msk                      /*!< GPIO x set bit 0 */
#define GPIO_SCR_IOSB1_Pos                  (1U)
#define GPIO_SCR_IOSB1_Msk                  (0x1U << GPIO_SCR_IOSB1_Pos)            /*!< 0x00000002 */
#define GPIO_SCR_IOSB1                      GPIO_SCR_IOSB1_Msk                      /*!< GPIO x set bit 1 */
#define GPIO_SCR_IOSB2_Pos                  (2U)
#define GPIO_SCR_IOSB2_Msk                  (0x1U << GPIO_SCR_IOSB2_Pos)            /*!< 0x00000004 */
#define GPIO_SCR_IOSB2                      GPIO_SCR_IOSB2_Msk                      /*!< GPIO x set bit 2 */
#define GPIO_SCR_IOSB3_Pos                  (3U)
#define GPIO_SCR_IOSB3_Msk                  (0x1U << GPIO_SCR_IOSB3_Pos)            /*!< 0x00000008 */
#define GPIO_SCR_IOSB3                      GPIO_SCR_IOSB3_Msk                      /*!< GPIO x set bit 3 */
#define GPIO_SCR_IOSB4_Pos                  (4U)
#define GPIO_SCR_IOSB4_Msk                  (0x1U << GPIO_SCR_IOSB4_Pos)            /*!< 0x00000010 */
#define GPIO_SCR_IOSB4                      GPIO_SCR_IOSB4_Msk                      /*!< GPIO x set bit 4 */
#define GPIO_SCR_IOSB5_Pos                  (5U)
#define GPIO_SCR_IOSB5_Msk                  (0x1U << GPIO_SCR_IOSB5_Pos)            /*!< 0x00000020 */
#define GPIO_SCR_IOSB5                      GPIO_SCR_IOSB5_Msk                      /*!< GPIO x set bit 5 */
#define GPIO_SCR_IOSB6_Pos                  (6U)
#define GPIO_SCR_IOSB6_Msk                  (0x1U << GPIO_SCR_IOSB6_Pos)            /*!< 0x00000040 */
#define GPIO_SCR_IOSB6                      GPIO_SCR_IOSB6_Msk                      /*!< GPIO x set bit 6 */
#define GPIO_SCR_IOSB7_Pos                  (7U)
#define GPIO_SCR_IOSB7_Msk                  (0x1U << GPIO_SCR_IOSB7_Pos)            /*!< 0x00000080 */
#define GPIO_SCR_IOSB7                      GPIO_SCR_IOSB7_Msk                      /*!< GPIO x set bit 7 */
#define GPIO_SCR_IOSB8_Pos                  (8U)
#define GPIO_SCR_IOSB8_Msk                  (0x1U << GPIO_SCR_IOSB8_Pos)            /*!< 0x00000100 */
#define GPIO_SCR_IOSB8                      GPIO_SCR_IOSB8_Msk                      /*!< GPIO x set bit 8 */
#define GPIO_SCR_IOSB9_Pos                  (9U)
#define GPIO_SCR_IOSB9_Msk                  (0x1U << GPIO_SCR_IOSB9_Pos)            /*!< 0x00000200 */
#define GPIO_SCR_IOSB9                      GPIO_SCR_IOSB9_Msk                      /*!< GPIO x set bit 9 */
#define GPIO_SCR_IOSB10_Pos                 (10U)
#define GPIO_SCR_IOSB10_Msk                 (0x1U << GPIO_SCR_IOSB10_Pos)           /*!< 0x00000400 */
#define GPIO_SCR_IOSB10                     GPIO_SCR_IOSB10_Msk                     /*!< GPIO x set bit 10 */
#define GPIO_SCR_IOSB11_Pos                 (11U)
#define GPIO_SCR_IOSB11_Msk                 (0x1U << GPIO_SCR_IOSB11_Pos)           /*!< 0x00000800 */
#define GPIO_SCR_IOSB11                     GPIO_SCR_IOSB11_Msk                     /*!< GPIO x set bit 11 */
#define GPIO_SCR_IOSB12_Pos                 (12U)
#define GPIO_SCR_IOSB12_Msk                 (0x1U << GPIO_SCR_IOSB12_Pos)           /*!< 0x00001000 */
#define GPIO_SCR_IOSB12                     GPIO_SCR_IOSB12_Msk                     /*!< GPIO x set bit 12 */
#define GPIO_SCR_IOSB13_Pos                 (13U)
#define GPIO_SCR_IOSB13_Msk                 (0x1U << GPIO_SCR_IOSB13_Pos)           /*!< 0x00002000 */
#define GPIO_SCR_IOSB13                     GPIO_SCR_IOSB13_Msk                     /*!< GPIO x set bit 13 */
#define GPIO_SCR_IOSB14_Pos                 (14U)
#define GPIO_SCR_IOSB14_Msk                 (0x1U << GPIO_SCR_IOSB14_Pos)           /*!< 0x00004000 */
#define GPIO_SCR_IOSB14                     GPIO_SCR_IOSB14_Msk                     /*!< GPIO x set bit 14 */
#define GPIO_SCR_IOSB15_Pos                 (15U)
#define GPIO_SCR_IOSB15_Msk                 (0x1U << GPIO_SCR_IOSB15_Pos)           /*!< 0x00008000 */
#define GPIO_SCR_IOSB15                     GPIO_SCR_IOSB15_Msk                     /*!< GPIO x set bit 15 */
#define GPIO_SCR_IOCB0_Pos                  (16U)
#define GPIO_SCR_IOCB0_Msk                  (0x1U << GPIO_SCR_IOCB0_Pos)            /*!< 0x00010000 */
#define GPIO_SCR_IOCB0                      GPIO_SCR_IOCB0_Msk                      /*!< GPIO x clear bit 0 */
#define GPIO_SCR_IOCB1_Pos                  (17U)
#define GPIO_SCR_IOCB1_Msk                  (0x1U << GPIO_SCR_IOCB1_Pos)            /*!< 0x00020000 */
#define GPIO_SCR_IOCB1                      GPIO_SCR_IOCB1_Msk                      /*!< GPIO x clear bit 1 */
#define GPIO_SCR_IOCB2_Pos                  (18U)
#define GPIO_SCR_IOCB2_Msk                  (0x1U << GPIO_SCR_IOCB2_Pos)            /*!< 0x00040000 */
#define GPIO_SCR_IOCB2                      GPIO_SCR_IOCB2_Msk                      /*!< GPIO x clear bit 2 */
#define GPIO_SCR_IOCB3_Pos                  (19U)
#define GPIO_SCR_IOCB3_Msk                  (0x1U << GPIO_SCR_IOCB3_Pos)            /*!< 0x00080000 */
#define GPIO_SCR_IOCB3                      GPIO_SCR_IOCB3_Msk                      /*!< GPIO x clear bit 3 */
#define GPIO_SCR_IOCB4_Pos                  (20U)
#define GPIO_SCR_IOCB4_Msk                  (0x1U << GPIO_SCR_IOCB4_Pos)            /*!< 0x00100000 */
#define GPIO_SCR_IOCB4                      GPIO_SCR_IOCB4_Msk                      /*!< GPIO x clear bit 4 */
#define GPIO_SCR_IOCB5_Pos                  (21U)
#define GPIO_SCR_IOCB5_Msk                  (0x1U << GPIO_SCR_IOCB5_Pos)            /*!< 0x00200000 */
#define GPIO_SCR_IOCB5                      GPIO_SCR_IOCB5_Msk                      /*!< GPIO x clear bit 5 */
#define GPIO_SCR_IOCB6_Pos                  (22U)
#define GPIO_SCR_IOCB6_Msk                  (0x1U << GPIO_SCR_IOCB6_Pos)            /*!< 0x00400000 */
#define GPIO_SCR_IOCB6                      GPIO_SCR_IOCB6_Msk                      /*!< GPIO x clear bit 6 */
#define GPIO_SCR_IOCB7_Pos                  (23U)
#define GPIO_SCR_IOCB7_Msk                  (0x1U << GPIO_SCR_IOCB7_Pos)            /*!< 0x00800000 */
#define GPIO_SCR_IOCB7                      GPIO_SCR_IOCB7_Msk                      /*!< GPIO x clear bit 7 */
#define GPIO_SCR_IOCB8_Pos                  (24U)
#define GPIO_SCR_IOCB8_Msk                  (0x1U << GPIO_SCR_IOCB8_Pos)            /*!< 0x01000000 */
#define GPIO_SCR_IOCB8                      GPIO_SCR_IOCB8_Msk                      /*!< GPIO x clear bit 8 */
#define GPIO_SCR_IOCB9_Pos                  (25U)
#define GPIO_SCR_IOCB9_Msk                  (0x1U << GPIO_SCR_IOCB9_Pos)            /*!< 0x02000000 */
#define GPIO_SCR_IOCB9                      GPIO_SCR_IOCB9_Msk                      /*!< GPIO x clear bit 9 */
#define GPIO_SCR_IOCB10_Pos                 (26U)
#define GPIO_SCR_IOCB10_Msk                 (0x1U << GPIO_SCR_IOCB10_Pos)           /*!< 0x04000000 */
#define GPIO_SCR_IOCB10                     GPIO_SCR_IOCB10_Msk                     /*!< GPIO x clear bit 10 */
#define GPIO_SCR_IOCB11_Pos                 (27U)
#define GPIO_SCR_IOCB11_Msk                 (0x1U << GPIO_SCR_IOCB11_Pos)           /*!< 0x08000000 */
#define GPIO_SCR_IOCB11                     GPIO_SCR_IOCB11_Msk                     /*!< GPIO x clear bit 11 */
#define GPIO_SCR_IOCB12_Pos                 (28U)
#define GPIO_SCR_IOCB12_Msk                 (0x1U << GPIO_SCR_IOCB12_Pos)           /*!< 0x10000000 */
#define GPIO_SCR_IOCB12                     GPIO_SCR_IOCB12_Msk                     /*!< GPIO x clear bit 12 */
#define GPIO_SCR_IOCB13_Pos                 (29U)
#define GPIO_SCR_IOCB13_Msk                 (0x1U << GPIO_SCR_IOCB13_Pos)           /*!< 0x20000000 */
#define GPIO_SCR_IOCB13                     GPIO_SCR_IOCB13_Msk                     /*!< GPIO x clear bit 13 */
#define GPIO_SCR_IOCB14_Pos                 (30U)
#define GPIO_SCR_IOCB14_Msk                 (0x1U << GPIO_SCR_IOCB14_Pos)           /*!< 0x40000000 */
#define GPIO_SCR_IOCB14                     GPIO_SCR_IOCB14_Msk                     /*!< GPIO x clear bit 14 */
#define GPIO_SCR_IOCB15_Pos                 (31U)
#define GPIO_SCR_IOCB15_Msk                 (0x1U << GPIO_SCR_IOCB15_Pos)           /*!< 0x80000000 */
#define GPIO_SCR_IOCB15                     GPIO_SCR_IOCB15_Msk                     /*!< GPIO x clear bit 15 */

