HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axg.h
#define IOMUX_REMAP7_XMC_GMUX_MUX1          0x00000000U                             /*!< NEW/PD5, D0/PD14, D1/PD15, D2/PD0, D3/PD1, D4/PE7, D5/PE8, D6/PE9, D7/PE10, D13/PD8, NOE/PD4 */
#define IOMUX_REMAP7_XMC_GMUX_MUX2_Pos      (24U)                                   /*!< 0x01000000 */
#define IOMUX_REMAP7_XMC_GMUX_MUX2_Msk      (0x1U << IOMUX_REMAP7_XMC_GMUX_MUX2_Pos)
#define IOMUX_REMAP7_XMC_GMUX_MUX2          IOMUX_REMAP7_XMC_GMUX_MUX2_Msk          /*!< NEW/PD2, D0/PB14, D1/PC6, D2/PC11, D3/PC12, D4/PA2, D5/PA3, D6/PA4, D7/PA5, D13/PB12, NOE/PC5 */
#define IOMUX_REMAP7_XMC_GMUX_MUX3_Pos      (25U)                                   /*!< 0x02000000 */
#define IOMUX_REMAP7_XMC_GMUX_MUX3_Msk      (0x1U << IOMUX_REMAP7_XMC_GMUX_MUX3_Pos)
#define IOMUX_REMAP7_XMC_GMUX_MUX3          IOMUX_REMAP7_XMC_GMUX_MUX3_Msk          /*!< NEW/PC2, D0/PB14, D1/PC6, D2/PC11, D3/PC12, D4/PA2, D5/PA3, D6/PA4, D7/PA5, D13/PB12, NOE/PC5 */

#define IOMUX_REMAP7_XMC_NADV_GMUX_Pos      (27U)                                   /*!< 0x08000000 */
#define IOMUX_REMAP7_XMC_NADV_GMUX_Msk      (0x1U << IOMUX_REMAP7_XMC_NADV_GMUX_Pos)
#define IOMUX_REMAP7_XMC_NADV_GMUX          IOMUX_REMAP7_XMC_NADV_GMUX_Msk          /*!< XMC NADV IO general multiplexing */

/*****************  Bit definition for IOMUX_REMAP8 register  *****************/
#define IOMUX_REMAP8_USART6_GMUX_Pos        (20U)
#define IOMUX_REMAP8_USART6_GMUX_Msk        (0xFU << IOMUX_REMAP8_USART6_GMUX_Pos)  /*!< 0x00F00000 */
#define IOMUX_REMAP8_USART6_GMUX            IOMUX_REMAP8_USART6_GMUX_Msk            /*!< USART6_GMUX[3:0] bits (USART6 IO general multiplexing) */
#define IOMUX_REMAP8_USART6_GMUX_0          (0x1U << IOMUX_REMAP8_USART6_GMUX_Pos)  /*!< 0x00100000 */
#define IOMUX_REMAP8_USART6_GMUX_1          (0x2U << IOMUX_REMAP8_USART6_GMUX_Pos)  /*!< 0x00200000 */
#define IOMUX_REMAP8_USART6_GMUX_2          (0x4U << IOMUX_REMAP8_USART6_GMUX_Pos)  /*!< 0x00400000 */
#define IOMUX_REMAP8_USART6_GMUX_3          (0x8U << IOMUX_REMAP8_USART6_GMUX_Pos)  /*!< 0x00800000 */

#define IOMUX_REMAP8_UART7_GMUX_Pos         (24U)
#define IOMUX_REMAP8_UART7_GMUX_Msk         (0xFU << IOMUX_REMAP8_UART7_GMUX_Pos)   /*!< 0x0F000000 */
#define IOMUX_REMAP8_UART7_GMUX             IOMUX_REMAP8_UART7_GMUX_Msk             /*!< UART7_GMUX[3:0] bits (UART7 IO general multiplexing) */
#define IOMUX_REMAP8_UART7_GMUX_0           (0x1U << IOMUX_REMAP8_UART7_GMUX_Pos)   /*!< 0x01000000 */
#define IOMUX_REMAP8_UART7_GMUX_1           (0x2U << IOMUX_REMAP8_UART7_GMUX_Pos)   /*!< 0x02000000 */
#define IOMUX_REMAP8_UART7_GMUX_2           (0x4U << IOMUX_REMAP8_UART7_GMUX_Pos)   /*!< 0x04000000 */
#define IOMUX_REMAP8_UART7_GMUX_3           (0x8U << IOMUX_REMAP8_UART7_GMUX_Pos)   /*!< 0x08000000 */

#define IOMUX_REMAP8_UART8_GMUX_Pos         (28U)
#define IOMUX_REMAP8_UART8_GMUX_Msk         (0xFU << IOMUX_REMAP8_UART8_GMUX_Pos)   /*!< 0xF0000000 */
#define IOMUX_REMAP8_UART8_GMUX             IOMUX_REMAP8_UART8_GMUX_Msk             /*!< UART8_GMUX[3:0] bits (UART8 IO general multiplexing) */
#define IOMUX_REMAP8_UART8_GMUX_0           (0x1U << IOMUX_REMAP8_UART8_GMUX_Pos)   /*!< 0x10000000 */
#define IOMUX_REMAP8_UART8_GMUX_1           (0x2U << IOMUX_REMAP8_UART8_GMUX_Pos)   /*!< 0x20000000 */
#define IOMUX_REMAP8_UART8_GMUX_2           (0x4U << IOMUX_REMAP8_UART8_GMUX_Pos)   /*!< 0x40000000 */
#define IOMUX_REMAP8_UART8_GMUX_3           (0x8U << IOMUX_REMAP8_UART8_GMUX_Pos)   /*!< 0x80000000 */

/******************************************************************************/
/*                                                                            */
/*                External interrupt/Event controller (EXINT)                 */
/*                                                                            */
/******************************************************************************/

/*****************  Bit definition for EXINT_INTEN register  ******************/
#define EXINT_INTEN_INTEN0_Pos              (0U)
#define EXINT_INTEN_INTEN0_Msk              (0x1U << EXINT_INTEN_INTEN0_Pos)        /*!< 0x00000001 */
#define EXINT_INTEN_INTEN0                  EXINT_INTEN_INTEN0_Msk                  /*!< Interrupt enable or disable on line 0 */
#define EXINT_INTEN_INTEN1_Pos              (1U)
#define EXINT_INTEN_INTEN1_Msk              (0x1U << EXINT_INTEN_INTEN1_Pos)        /*!< 0x00000002 */
#define EXINT_INTEN_INTEN1                  EXINT_INTEN_INTEN1_Msk                  /*!< Interrupt enable or disable on line 1 */
#define EXINT_INTEN_INTEN2_Pos              (2U)
#define EXINT_INTEN_INTEN2_Msk              (0x1U << EXINT_INTEN_INTEN2_Pos)        /*!< 0x00000004 */
#define EXINT_INTEN_INTEN2                  EXINT_INTEN_INTEN2_Msk                  /*!< Interrupt enable or disable on line 2 */
#define EXINT_INTEN_INTEN3_Pos              (3U)
#define EXINT_INTEN_INTEN3_Msk              (0x1U << EXINT_INTEN_INTEN3_Pos)        /*!< 0x00000008 */
#define EXINT_INTEN_INTEN3                  EXINT_INTEN_INTEN3_Msk                  /*!< Interrupt enable or disable on line 3 */
#define EXINT_INTEN_INTEN4_Pos              (4U)
#define EXINT_INTEN_INTEN4_Msk              (0x1U << EXINT_INTEN_INTEN4_Pos)        /*!< 0x00000010 */
#define EXINT_INTEN_INTEN4                  EXINT_INTEN_INTEN4_Msk                  /*!< Interrupt enable or disable on line 4 */
#define EXINT_INTEN_INTEN5_Pos              (5U)
#define EXINT_INTEN_INTEN5_Msk              (0x1U << EXINT_INTEN_INTEN5_Pos)        /*!< 0x00000020 */
#define EXINT_INTEN_INTEN5                  EXINT_INTEN_INTEN5_Msk                  /*!< Interrupt enable or disable on line 5 */
#define EXINT_INTEN_INTEN6_Pos              (6U)
#define EXINT_INTEN_INTEN6_Msk              (0x1U << EXINT_INTEN_INTEN6_Pos)        /*!< 0x00000040 */
#define EXINT_INTEN_INTEN6                  EXINT_INTEN_INTEN6_Msk                  /*!< Interrupt enable or disable on line 6 */
#define EXINT_INTEN_INTEN7_Pos              (7U)
#define EXINT_INTEN_INTEN7_Msk              (0x1U << EXINT_INTEN_INTEN7_Pos)        /*!< 0x00000080 */
#define EXINT_INTEN_INTEN7                  EXINT_INTEN_INTEN7_Msk                  /*!< Interrupt enable or disable on line 7 */
#define EXINT_INTEN_INTEN8_Pos              (8U)
#define EXINT_INTEN_INTEN8_Msk              (0x1U << EXINT_INTEN_INTEN8_Pos)        /*!< 0x00000100 */
#define EXINT_INTEN_INTEN8                  EXINT_INTEN_INTEN8_Msk                  /*!< Interrupt enable or disable on line 8 */
#define EXINT_INTEN_INTEN9_Pos              (9U)
#define EXINT_INTEN_INTEN9_Msk              (0x1U << EXINT_INTEN_INTEN9_Pos)        /*!< 0x00000200 */
#define EXINT_INTEN_INTEN9                  EXINT_INTEN_INTEN9_Msk                  /*!< Interrupt enable or disable on line 9 */
#define EXINT_INTEN_INTEN10_Pos             (10U)
#define EXINT_INTEN_INTEN10_Msk             (0x1U << EXINT_INTEN_INTEN10_Pos)       /*!< 0x00000400 */
#define EXINT_INTEN_INTEN10                 EXINT_INTEN_INTEN10_Msk                 /*!< Interrupt enable or disable on line 10 */
#define EXINT_INTEN_INTEN11_Pos             (11U)
#define EXINT_INTEN_INTEN11_Msk             (0x1U << EXINT_INTEN_INTEN11_Pos)       /*!< 0x00000800 */
#define EXINT_INTEN_INTEN11                 EXINT_INTEN_INTEN11_Msk                 /*!< Interrupt enable or disable on line 11 */
#define EXINT_INTEN_INTEN12_Pos             (12U)
#define EXINT_INTEN_INTEN12_Msk             (0x1U << EXINT_INTEN_INTEN12_Pos)       /*!< 0x00001000 */
#define EXINT_INTEN_INTEN12                 EXINT_INTEN_INTEN12_Msk                 /*!< Interrupt enable or disable on line 12 */
#define EXINT_INTEN_INTEN13_Pos             (13U)
#define EXINT_INTEN_INTEN13_Msk             (0x1U << EXINT_INTEN_INTEN13_Pos)       /*!< 0x00002000 */
#define EXINT_INTEN_INTEN13                 EXINT_INTEN_INTEN13_Msk                 /*!< Interrupt enable or disable on line 13 */
#define EXINT_INTEN_INTEN14_Pos             (14U)
#define EXINT_INTEN_INTEN14_Msk             (0x1U << EXINT_INTEN_INTEN14_Pos)       /*!< 0x00004000 */
#define EXINT_INTEN_INTEN14                 EXINT_INTEN_INTEN14_Msk                 /*!< Interrupt enable or disable on line 14 */
#define EXINT_INTEN_INTEN15_Pos             (15U)
#define EXINT_INTEN_INTEN15_Msk             (0x1U << EXINT_INTEN_INTEN15_Pos)       /*!< 0x00008000 */
#define EXINT_INTEN_INTEN15                 EXINT_INTEN_INTEN15_Msk                 /*!< Interrupt enable or disable on line 15 */
#define EXINT_INTEN_INTEN16_Pos             (16U)
#define EXINT_INTEN_INTEN16_Msk             (0x1U << EXINT_INTEN_INTEN16_Pos)       /*!< 0x00010000 */
#define EXINT_INTEN_INTEN16                 EXINT_INTEN_INTEN16_Msk                 /*!< Interrupt enable or disable on line 16 */
#define EXINT_INTEN_INTEN17_Pos             (17U)
#define EXINT_INTEN_INTEN17_Msk             (0x1U << EXINT_INTEN_INTEN17_Pos)       /*!< 0x00020000 */
#define EXINT_INTEN_INTEN17                 EXINT_INTEN_INTEN17_Msk                 /*!< Interrupt enable or disable on line 17 */
#define EXINT_INTEN_INTEN18_Pos             (18U)
#define EXINT_INTEN_INTEN18_Msk             (0x1U << EXINT_INTEN_INTEN18_Pos)       /*!< 0x00040000 */
#define EXINT_INTEN_INTEN18                 EXINT_INTEN_INTEN18_Msk                 /*!< Interrupt enable or disable on line 18 */

/* References Defines */
#define EXINT_INTEN_INT0                    EXINT_INTEN_INTEN0
#define EXINT_INTEN_INT1                    EXINT_INTEN_INTEN1
#define EXINT_INTEN_INT2                    EXINT_INTEN_INTEN2
#define EXINT_INTEN_INT3                    EXINT_INTEN_INTEN3
#define EXINT_INTEN_INT4                    EXINT_INTEN_INTEN4
#define EXINT_INTEN_INT5                    EXINT_INTEN_INTEN5
#define EXINT_INTEN_INT6                    EXINT_INTEN_INTEN6
#define EXINT_INTEN_INT7                    EXINT_INTEN_INTEN7
#define EXINT_INTEN_INT8                    EXINT_INTEN_INTEN8
#define EXINT_INTEN_INT9                    EXINT_INTEN_INTEN9
#define EXINT_INTEN_INT10                   EXINT_INTEN_INTEN10
#define EXINT_INTEN_INT11                   EXINT_INTEN_INTEN11
#define EXINT_INTEN_INT12                   EXINT_INTEN_INTEN12
#define EXINT_INTEN_INT13                   EXINT_INTEN_INTEN13
#define EXINT_INTEN_INT14                   EXINT_INTEN_INTEN14
#define EXINT_INTEN_INT15                   EXINT_INTEN_INTEN15
#define EXINT_INTEN_INT16                   EXINT_INTEN_INTEN16
#define EXINT_INTEN_INT17                   EXINT_INTEN_INTEN17
#define EXINT_INTEN_INT18                   EXINT_INTEN_INTEN18
#define EXINT_INTEN_INT                     0x0007FFFFU                             /*!< Interrupt enable or disable all */
 
/*****************  Bit definition for EXINT_EVTEN register  ******************/
#define EXINT_EVTEN_EVTEN0_Pos              (0U)
#define EXINT_EVTEN_EVTEN0_Msk              (0x1U << EXINT_EVTEN_EVTEN0_Pos)        /*!< 0x00000001 */
#define EXINT_EVTEN_EVTEN0                  EXINT_EVTEN_EVTEN0_Msk                  /*!< Event enable or disable on line 0 */
#define EXINT_EVTEN_EVTEN1_Pos              (1U)
#define EXINT_EVTEN_EVTEN1_Msk              (0x1U << EXINT_EVTEN_EVTEN1_Pos)        /*!< 0x00000002 */
#define EXINT_EVTEN_EVTEN1                  EXINT_EVTEN_EVTEN1_Msk                  /*!< Event enable or disable on line 1 */
#define EXINT_EVTEN_EVTEN2_Pos              (2U)
#define EXINT_EVTEN_EVTEN2_Msk              (0x1U << EXINT_EVTEN_EVTEN2_Pos)        /*!< 0x00000004 */
#define EXINT_EVTEN_EVTEN2                  EXINT_EVTEN_EVTEN2_Msk                  /*!< Event enable or disable on line 2 */
#define EXINT_EVTEN_EVTEN3_Pos              (3U)
#define EXINT_EVTEN_EVTEN3_Msk              (0x1U << EXINT_EVTEN_EVTEN3_Pos)        /*!< 0x00000008 */
#define EXINT_EVTEN_EVTEN3                  EXINT_EVTEN_EVTEN3_Msk                  /*!< Event enable or disable on line 3 */
#define EXINT_EVTEN_EVTEN4_Pos              (4U)
#define EXINT_EVTEN_EVTEN4_Msk              (0x1U << EXINT_EVTEN_EVTEN4_Pos)        /*!< 0x00000010 */
#define EXINT_EVTEN_EVTEN4                  EXINT_EVTEN_EVTEN4_Msk                  /*!< Event enable or disable on line 4 */
#define EXINT_EVTEN_EVTEN5_Pos              (5U)
#define EXINT_EVTEN_EVTEN5_Msk              (0x1U << EXINT_EVTEN_EVTEN5_Pos)        /*!< 0x00000020 */
#define EXINT_EVTEN_EVTEN5                  EXINT_EVTEN_EVTEN5_Msk                  /*!< Event enable or disable on line 5 */
#define EXINT_EVTEN_EVTEN6_Pos              (6U)
#define EXINT_EVTEN_EVTEN6_Msk              (0x1U << EXINT_EVTEN_EVTEN6_Pos)        /*!< 0x00000040 */
#define EXINT_EVTEN_EVTEN6                  EXINT_EVTEN_EVTEN6_Msk                  /*!< Event enable or disable on line 6 */
#define EXINT_EVTEN_EVTEN7_Pos              (7U)
#define EXINT_EVTEN_EVTEN7_Msk              (0x1U << EXINT_EVTEN_EVTEN7_Pos)        /*!< 0x00000080 */
#define EXINT_EVTEN_EVTEN7                  EXINT_EVTEN_EVTEN7_Msk                  /*!< Event enable or disable on line 7 */
#define EXINT_EVTEN_EVTEN8_Pos              (8U)
#define EXINT_EVTEN_EVTEN8_Msk              (0x1U << EXINT_EVTEN_EVTEN8_Pos)        /*!< 0x00000100 */
#define EXINT_EVTEN_EVTEN8                  EXINT_EVTEN_EVTEN8_Msk                  /*!< Event enable or disable on line 8 */
#define EXINT_EVTEN_EVTEN9_Pos              (9U)
#define EXINT_EVTEN_EVTEN9_Msk              (0x1U << EXINT_EVTEN_EVTEN9_Pos)        /*!< 0x00000200 */
#define EXINT_EVTEN_EVTEN9                  EXINT_EVTEN_EVTEN9_Msk                  /*!< Event enable or disable on line 9 */
#define EXINT_EVTEN_EVTEN10_Pos             (10U)
#define EXINT_EVTEN_EVTEN10_Msk             (0x1U << EXINT_EVTEN_EVTEN10_Pos)       /*!< 0x00000400 */
#define EXINT_EVTEN_EVTEN10                 EXINT_EVTEN_EVTEN10_Msk                 /*!< Event enable or disable on line 10 */
#define EXINT_EVTEN_EVTEN11_Pos             (11U)
#define EXINT_EVTEN_EVTEN11_Msk             (0x1U << EXINT_EVTEN_EVTEN11_Pos)       /*!< 0x00000800 */
#define EXINT_EVTEN_EVTEN11                 EXINT_EVTEN_EVTEN11_Msk                 /*!< Event enable or disable on line 11 */
#define EXINT_EVTEN_EVTEN12_Pos             (12U)
#define EXINT_EVTEN_EVTEN12_Msk             (0x1U << EXINT_EVTEN_EVTEN12_Pos)       /*!< 0x00001000 */
#define EXINT_EVTEN_EVTEN12                 EXINT_EVTEN_EVTEN12_Msk                 /*!< Event enable or disable on line 12 */
#define EXINT_EVTEN_EVTEN13_Pos             (13U)
#define EXINT_EVTEN_EVTEN13_Msk             (0x1U << EXINT_EVTEN_EVTEN13_Pos)       /*!< 0x00002000 */
#define EXINT_EVTEN_EVTEN13                 EXINT_EVTEN_EVTEN13_Msk                 /*!< Event enable or disable on line 13 */
#define EXINT_EVTEN_EVTEN14_Pos             (14U)
#define EXINT_EVTEN_EVTEN14_Msk             (0x1U << EXINT_EVTEN_EVTEN14_Pos)       /*!< 0x00004000 */
#define EXINT_EVTEN_EVTEN14                 EXINT_EVTEN_EVTEN14_Msk                 /*!< Event enable or disable on line 14 */
#define EXINT_EVTEN_EVTEN15_Pos             (15U)
#define EXINT_EVTEN_EVTEN15_Msk             (0x1U << EXINT_EVTEN_EVTEN15_Pos)       /*!< 0x00008000 */
#define EXINT_EVTEN_EVTEN15                 EXINT_EVTEN_EVTEN15_Msk                 /*!< Event enable or disable on line 15 */
#define EXINT_EVTEN_EVTEN16_Pos             (16U)
#define EXINT_EVTEN_EVTEN16_Msk             (0x1U << EXINT_EVTEN_EVTEN16_Pos)       /*!< 0x00010000 */
#define EXINT_EVTEN_EVTEN16                 EXINT_EVTEN_EVTEN16_Msk                 /*!< Event enable or disable on line 16 */
#define EXINT_EVTEN_EVTEN17_Pos             (17U)
#define EXINT_EVTEN_EVTEN17_Msk             (0x1U << EXINT_EVTEN_EVTEN17_Pos)       /*!< 0x00020000 */
#define EXINT_EVTEN_EVTEN17                 EXINT_EVTEN_EVTEN17_Msk                 /*!< Event enable or disable on line 17 */
#define EXINT_EVTEN_EVTEN18_Pos             (18U)
#define EXINT_EVTEN_EVTEN18_Msk             (0x1U << EXINT_EVTEN_EVTEN18_Pos)       /*!< 0x00040000 */
#define EXINT_EVTEN_EVTEN18                 EXINT_EVTEN_EVTEN18_Msk                 /*!< Event enable or disable on line 18 */

/* References Defines */
#define EXINT_EVTEN_EVT0                    EXINT_EVTEN_EVTEN0
#define EXINT_EVTEN_EVT1                    EXINT_EVTEN_EVTEN1
#define EXINT_EVTEN_EVT2                    EXINT_EVTEN_EVTEN2
#define EXINT_EVTEN_EVT3                    EXINT_EVTEN_EVTEN3
#define EXINT_EVTEN_EVT4                    EXINT_EVTEN_EVTEN4
#define EXINT_EVTEN_EVT5                    EXINT_EVTEN_EVTEN5
#define EXINT_EVTEN_EVT6                    EXINT_EVTEN_EVTEN6
#define EXINT_EVTEN_EVT7                    EXINT_EVTEN_EVTEN7
#define EXINT_EVTEN_EVT8                    EXINT_EVTEN_EVTEN8
#define EXINT_EVTEN_EVT9                    EXINT_EVTEN_EVTEN9
#define EXINT_EVTEN_EVT10                   EXINT_EVTEN_EVTEN10
#define EXINT_EVTEN_EVT11                   EXINT_EVTEN_EVTEN11
#define EXINT_EVTEN_EVT12                   EXINT_EVTEN_EVTEN12
#define EXINT_EVTEN_EVT13                   EXINT_EVTEN_EVTEN13
#define EXINT_EVTEN_EVT14                   EXINT_EVTEN_EVTEN14
#define EXINT_EVTEN_EVT15                   EXINT_EVTEN_EVTEN15
#define EXINT_EVTEN_EVT16                   EXINT_EVTEN_EVTEN16
#define EXINT_EVTEN_EVT17                   EXINT_EVTEN_EVTEN17
#define EXINT_EVTEN_EVT18                   EXINT_EVTEN_EVTEN18

