HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axg.h
/*******************  Bit definition for TMR_CVAL register  *******************/
#define TMR_CVAL_CVAL_Pos                   (0U)
#define TMR_CVAL_CVAL_Msk                   (0xFFFFFFFFU << TMR_CVAL_CVAL_Pos)      /*!< 0xFFFFFFFF */
#define TMR_CVAL_CVAL                       TMR_CVAL_CVAL_Msk                       /*!< Counter value */

/*******************  Bit definition for TMR_DIV register  ********************/
#define TMR_DIV_DIV_Pos                     (0U)
#define TMR_DIV_DIV_Msk                     (0xFFFFU << TMR_DIV_DIV_Pos)            /*!< 0x0000FFFF */
#define TMR_DIV_DIV                         TMR_DIV_DIV_Msk                         /*!< Divider value */

/********************  Bit definition for TMR_PR register  ********************/
#define TMR_PR_PR_Pos                       (0U)
#define TMR_PR_PR_Msk                       (0xFFFFFFFFU << TMR_PR_PR_Pos)          /*!< 0xFFFFFFFF */
#define TMR_PR_PR                           TMR_PR_PR_Msk                           /*!< Period value */

/*******************  Bit definition for TMR_RPR register  ********************/
#define TMR_RPR_RPR_Pos                     (0U)
#define TMR_RPR_RPR_Msk                     (0xFFU << TMR_RPR_RPR_Pos)              /*!< 0x000000FF */
#define TMR_RPR_RPR                         TMR_RPR_RPR_Msk                         /*!< Repetition of period value */

/*******************  Bit definition for TMR_C1DT register  *******************/
#define TMR_C1DT_C1DT_Pos                   (0U)
#define TMR_C1DT_C1DT_Msk                   (0xFFFFU << TMR_C1DT_C1DT_Pos)          /*!< 0x0000FFFF */
#define TMR_C1DT_C1DT                       TMR_C1DT_C1DT_Msk                       /*!< Channel 1 data register */

/*******************  Bit definition for TMR_C2DT register  *******************/
#define TMR_C2DT_C2DT_Pos                   (0U)
#define TMR_C2DT_C2DT_Msk                   (0xFFFFU << TMR_C2DT_C2DT_Pos)          /*!< 0x0000FFFF */
#define TMR_C2DT_C2DT                       TMR_C2DT_C2DT_Msk                       /*!< Channel 2 data register */

/*******************  Bit definition for TMR_C3DT register  *******************/
#define TMR_C3DT_C3DT_Pos                   (0U)
#define TMR_C3DT_C3DT_Msk                   (0xFFFFU << TMR_C3DT_C3DT_Pos)          /*!< 0x0000FFFF */
#define TMR_C3DT_C3DT                       TMR_C3DT_C3DT_Msk                       /*!< Channel 3 data register */

/*******************  Bit definition for TMR_C4DT register  *******************/
#define TMR_C4DT_C4DT_Pos                   (0U)
#define TMR_C4DT_C4DT_Msk                   (0xFFFFU << TMR_C4DT_C4DT_Pos)          /*!< 0x0000FFFF */
#define TMR_C4DT_C4DT                       TMR_C4DT_C4DT_Msk                       /*!< Channel 4 data register */

/*******************  Bit definition for TMR_BRK register  ********************/
#define TMR_BRK_DTC_Pos                     (0U)
#define TMR_BRK_DTC_Msk                     (0xFFU << TMR_BRK_DTC_Pos)              /*!< 0x000000FF */
#define TMR_BRK_DTC                         TMR_BRK_DTC_Msk                         /*!< DTC[0:7] bits (Dead-time configuration) */
#define TMR_BRK_DTC_0                       (0x01U << TMR_BRK_DTC_Pos)              /*!< 0x00000001 */
#define TMR_BRK_DTC_1                       (0x02U << TMR_BRK_DTC_Pos)              /*!< 0x00000002 */
#define TMR_BRK_DTC_2                       (0x04U << TMR_BRK_DTC_Pos)              /*!< 0x00000004 */
#define TMR_BRK_DTC_3                       (0x08U << TMR_BRK_DTC_Pos)              /*!< 0x00000008 */
#define TMR_BRK_DTC_4                       (0x10U << TMR_BRK_DTC_Pos)              /*!< 0x00000010 */
#define TMR_BRK_DTC_5                       (0x20U << TMR_BRK_DTC_Pos)              /*!< 0x00000020 */
#define TMR_BRK_DTC_6                       (0x40U << TMR_BRK_DTC_Pos)              /*!< 0x00000040 */
#define TMR_BRK_DTC_7                       (0x80U << TMR_BRK_DTC_Pos)              /*!< 0x00000080 */

#define TMR_BRK_WPC_Pos                     (8U)
#define TMR_BRK_WPC_Msk                     (0x3U << TMR_BRK_WPC_Pos)               /*!< 0x00000300 */
#define TMR_BRK_WPC                         TMR_BRK_WPC_Msk                         /*!< WPC[1:0] bits (Write protection configuration) */
#define TMR_BRK_WPC_0                       (0x1U << TMR_BRK_WPC_Pos)               /*!< 0x00000100 */
#define TMR_BRK_WPC_1                       (0x2U << TMR_BRK_WPC_Pos)               /*!< 0x00000200 */

#define TMR_BRK_FCSODIS_Pos                 (10U)
#define TMR_BRK_FCSODIS_Msk                 (0x1U << TMR_BRK_FCSODIS_Pos)           /*!< 0x00000400 */
#define TMR_BRK_FCSODIS                     TMR_BRK_FCSODIS_Msk                     /*!< Frozen channel status when holistic output disable */
#define TMR_BRK_FCSOEN_Pos                  (11U)
#define TMR_BRK_FCSOEN_Msk                  (0x1U << TMR_BRK_FCSOEN_Pos)            /*!< 0x00000800 */
#define TMR_BRK_FCSOEN                      TMR_BRK_FCSOEN_Msk                      /*!< Frozen channel status when holistic output enable */
#define TMR_BRK_BRKEN_Pos                   (12U)
#define TMR_BRK_BRKEN_Msk                   (0x1U << TMR_BRK_BRKEN_Pos)             /*!< 0x00001000 */
#define TMR_BRK_BRKEN                       TMR_BRK_BRKEN_Msk                       /*!< Break enable */
#define TMR_BRK_BRKV_Pos                    (13U)
#define TMR_BRK_BRKV_Msk                    (0x1U << TMR_BRK_BRKV_Pos)              /*!< 0x00002000 */
#define TMR_BRK_BRKV                        TMR_BRK_BRKV_Msk                        /*!< Break input validity */
#define TMR_BRK_AOEN_Pos                    (14U)
#define TMR_BRK_AOEN_Msk                    (0x1U << TMR_BRK_AOEN_Pos)              /*!< 0x00004000 */
#define TMR_BRK_AOEN                        TMR_BRK_AOEN_Msk                        /*!< Automatic output enable */
#define TMR_BRK_OEN_Pos                     (15U)
#define TMR_BRK_OEN_Msk                     (0x1U << TMR_BRK_OEN_Pos)               /*!< 0x00008000 */
#define TMR_BRK_OEN                         TMR_BRK_OEN_Msk                         /*!< Output enable */

