HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axg.h
/*****************  Bit definition for TMR_DMACTRL register  ******************/
#define TMR_DMACTRL_ADDR_Pos                (0U)
#define TMR_DMACTRL_ADDR_Msk                (0x1FU << TMR_DMACTRL_ADDR_Pos)         /*!< 0x0000001F */
#define TMR_DMACTRL_ADDR                    TMR_DMACTRL_ADDR_Msk                    /*!< ADDR[4:0] bits (DMA transfer address offset) */
#define TMR_DMACTRL_ADDR_0                  (0x01U << TMR_DMACTRL_ADDR_Pos)         /*!< 0x00000001 */
#define TMR_DMACTRL_ADDR_1                  (0x02U << TMR_DMACTRL_ADDR_Pos)         /*!< 0x00000002 */
#define TMR_DMACTRL_ADDR_2                  (0x04U << TMR_DMACTRL_ADDR_Pos)         /*!< 0x00000004 */
#define TMR_DMACTRL_ADDR_3                  (0x08U << TMR_DMACTRL_ADDR_Pos)         /*!< 0x00000008 */
#define TMR_DMACTRL_ADDR_4                  (0x10U << TMR_DMACTRL_ADDR_Pos)         /*!< 0x00000010 */

#define TMR_DMACTRL_DTB_Pos                 (8U)
#define TMR_DMACTRL_DTB_Msk                 (0x1FU << TMR_DMACTRL_DTB_Pos)          /*!< 0x00001F00 */
#define TMR_DMACTRL_DTB                     TMR_DMACTRL_DTB_Msk                     /*!< DTB[4:0] bits (DMA transfer bytes) */
#define TMR_DMACTRL_DTB_0                   (0x01U << TMR_DMACTRL_DTB_Pos)          /*!< 0x00000100 */
#define TMR_DMACTRL_DTB_1                   (0x02U << TMR_DMACTRL_DTB_Pos)          /*!< 0x00000200 */
#define TMR_DMACTRL_DTB_2                   (0x04U << TMR_DMACTRL_DTB_Pos)          /*!< 0x00000400 */
#define TMR_DMACTRL_DTB_3                   (0x08U << TMR_DMACTRL_DTB_Pos)          /*!< 0x00000800 */
#define TMR_DMACTRL_DTB_4                   (0x10U << TMR_DMACTRL_DTB_Pos)          /*!< 0x00001000 */

/******************  Bit definition for TMR_DMADT register  *******************/
#define TMR_DMADT_DMADT_Pos                 (0U)
#define TMR_DMADT_DMADT_Msk                 (0xFFFFU << TMR_DMADT_DMADT_Pos)        /*!< 0x0000FFFF */
#define TMR_DMADT_DMADT                     TMR_DMADT_DMADT_Msk                     /*!< DMA data register */

/******************************************************************************/
/*                                                                            */
/*                        Window watchdog timer (WWDT)                        */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for WWDT_CTRL register  *******************/
#define WWDT_CTRL_CNT_Pos                   (0U)
#define WWDT_CTRL_CNT_Msk                   (0x7FU << WWDT_CTRL_CNT_Pos)            /*!< 0x0000007F */
#define WWDT_CTRL_CNT                       WWDT_CTRL_CNT_Msk                       /*!< CNT[6:0] bits (Down counter) */
#define WWDT_CTRL_CNT_0                     (0x01U << WWDT_CTRL_CNT_Pos)            /*!< 0x00000001 */
#define WWDT_CTRL_CNT_1                     (0x02U << WWDT_CTRL_CNT_Pos)            /*!< 0x00000002 */
#define WWDT_CTRL_CNT_2                     (0x04U << WWDT_CTRL_CNT_Pos)            /*!< 0x00000004 */
#define WWDT_CTRL_CNT_3                     (0x08U << WWDT_CTRL_CNT_Pos)            /*!< 0x00000008 */
#define WWDT_CTRL_CNT_4                     (0x10U << WWDT_CTRL_CNT_Pos)            /*!< 0x00000010 */
#define WWDT_CTRL_CNT_5                     (0x20U << WWDT_CTRL_CNT_Pos)            /*!< 0x00000020 */
#define WWDT_CTRL_CNT_6                     (0x40U << WWDT_CTRL_CNT_Pos)            /*!< 0x00000040 */

/* Legacy defines */
#define WWDT_CTRL_CNT0                      WWDT_CTRL_CNT_0
#define WWDT_CTRL_CNT1                      WWDT_CTRL_CNT_1
#define WWDT_CTRL_CNT2                      WWDT_CTRL_CNT_2
#define WWDT_CTRL_CNT3                      WWDT_CTRL_CNT_3
#define WWDT_CTRL_CNT4                      WWDT_CTRL_CNT_4
#define WWDT_CTRL_CNT5                      WWDT_CTRL_CNT_5
#define WWDT_CTRL_CNT6                      WWDT_CTRL_CNT_6

#define WWDT_CTRL_WWDTEN_Pos                (7U)
#define WWDT_CTRL_WWDTEN_Msk                (0x1U << WWDT_CTRL_WWDTEN_Pos)          /*!< 0x00000080 */
#define WWDT_CTRL_WWDTEN                    WWDT_CTRL_WWDTEN_Msk                    /*!< Window watchdog enable */

/*******************  Bit definition for WWDT_CFG register  *******************/
#define WWDT_CFG_WIN_Pos                    (0U)
#define WWDT_CFG_WIN_Msk                    (0x7FU << WWDT_CFG_WIN_Pos)             /*!< 0x0000007F */
#define WWDT_CFG_WIN                        WWDT_CFG_WIN_Msk                        /*!< WIN[6:0] bits (Window value) */
#define WWDT_CFG_WIN_0                      (0x01U << WWDT_CFG_WIN_Pos)             /*!< 0x00000001 */
#define WWDT_CFG_WIN_1                      (0x02U << WWDT_CFG_WIN_Pos)             /*!< 0x00000002 */
#define WWDT_CFG_WIN_2                      (0x04U << WWDT_CFG_WIN_Pos)             /*!< 0x00000004 */
#define WWDT_CFG_WIN_3                      (0x08U << WWDT_CFG_WIN_Pos)             /*!< 0x00000008 */
#define WWDT_CFG_WIN_4                      (0x10U << WWDT_CFG_WIN_Pos)             /*!< 0x00000010 */
#define WWDT_CFG_WIN_5                      (0x20U << WWDT_CFG_WIN_Pos)             /*!< 0x00000020 */
#define WWDT_CFG_WIN_6                      (0x40U << WWDT_CFG_WIN_Pos)             /*!< 0x00000040 */

/* Legacy defines */
#define WWDT_CFG_WIN0                       WWDT_CFG_WIN_0
#define WWDT_CFG_WIN1                       WWDT_CFG_WIN_1
#define WWDT_CFG_WIN2                       WWDT_CFG_WIN_2
#define WWDT_CFG_WIN3                       WWDT_CFG_WIN_3
#define WWDT_CFG_WIN4                       WWDT_CFG_WIN_4
#define WWDT_CFG_WIN5                       WWDT_CFG_WIN_5
#define WWDT_CFG_WIN6                       WWDT_CFG_WIN_6

#define WWDT_CFG_DIV_Pos                    (7U)
#define WWDT_CFG_DIV_Msk                    (0x3U << WWDT_CFG_DIV_Pos)              /*!< 0x00000180 */
#define WWDT_CFG_DIV                        WWDT_CFG_DIV_Msk                        /*!< DIV[1:0] bits (Clock division value) */
#define WWDT_CFG_DIV_0                      (0x1U << WWDT_CFG_DIV_Pos)              /*!< 0x00000080 */
#define WWDT_CFG_DIV_1                      (0x2U << WWDT_CFG_DIV_Pos)              /*!< 0x00000100 */

