HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axg.h
/*****************  Bit definition for XMC_BK2CTRL register  ******************/
#define XMC_BK2CTRL_NWEN_Pos                (1U)
#define XMC_BK2CTRL_NWEN_Msk                (0x1U << XMC_BK2CTRL_NWEN_Pos)          /*!< 0x00000002 */
#define XMC_BK2CTRL_NWEN                    XMC_BK2CTRL_NWEN_Msk                    /*!< Wait feature enable */
#define XMC_BK2CTRL_EN_Pos                  (2U)
#define XMC_BK2CTRL_EN_Msk                  (0x1U << XMC_BK2CTRL_EN_Pos)            /*!< 0x00000004 */
#define XMC_BK2CTRL_EN                      XMC_BK2CTRL_EN_Msk                      /*!< Memory bank enable */
#define XMC_BK2CTRL_DEV_Pos                 (3U)
#define XMC_BK2CTRL_DEV_Msk                 (0x1U << XMC_BK2CTRL_DEV_Pos)           /*!< 0x00000008 */
#define XMC_BK2CTRL_DEV                     XMC_BK2CTRL_DEV_Msk                     /*!< Memory device type */

#define XMC_BK2CTRL_EXTMDBW_Pos             (4U)
#define XMC_BK2CTRL_EXTMDBW_Msk             (0x3U << XMC_BK2CTRL_EXTMDBW_Pos)       /*!< 0x00000030 */
#define XMC_BK2CTRL_EXTMDBW                 XMC_BK2CTRL_EXTMDBW_Msk                 /*!< EXTMDBW[1:0] bits (External memory data bus width) */
#define XMC_BK2CTRL_EXTMDBW_0               (0x1U << XMC_BK2CTRL_EXTMDBW_Pos)       /*!< 0x00000010 */
#define XMC_BK2CTRL_EXTMDBW_1               (0x2U << XMC_BK2CTRL_EXTMDBW_Pos)       /*!< 0x00000020 */

#define XMC_BK2CTRL_ECCEN_Pos               (6U)
#define XMC_BK2CTRL_ECCEN_Msk               (0x1U << XMC_BK2CTRL_ECCEN_Pos)         /*!< 0x00000040 */
#define XMC_BK2CTRL_ECCEN                   XMC_BK2CTRL_ECCEN_Msk                   /*!< ECC enable */

#define XMC_BK2CTRL_TCR_Pos                 (9U)
#define XMC_BK2CTRL_TCR_Msk                 (0xFU << XMC_BK2CTRL_TCR_Pos)           /*!< 0x00001E00 */
#define XMC_BK2CTRL_TCR                     XMC_BK2CTRL_TCR_Msk                     /*!< TCR[3:0] bits (CLE to RE delay) */
#define XMC_BK2CTRL_TCR_0                   (0x1U << XMC_BK2CTRL_TCR_Pos)           /*!< 0x00000200 */
#define XMC_BK2CTRL_TCR_1                   (0x2U << XMC_BK2CTRL_TCR_Pos)           /*!< 0x00000400 */
#define XMC_BK2CTRL_TCR_2                   (0x4U << XMC_BK2CTRL_TCR_Pos)           /*!< 0x00000800 */
#define XMC_BK2CTRL_TCR_3                   (0x8U << XMC_BK2CTRL_TCR_Pos)           /*!< 0x00001000 */

#define XMC_BK2CTRL_TAR_Pos                 (13U)
#define XMC_BK2CTRL_TAR_Msk                 (0xFU << XMC_BK2CTRL_TAR_Pos)           /*!< 0x0001E000 */
#define XMC_BK2CTRL_TAR                     XMC_BK2CTRL_TAR_Msk                     /*!< TAR[3:0] bits (ALE to RE delay) */
#define XMC_BK2CTRL_TAR_0                   (0x1U << XMC_BK2CTRL_TAR_Pos)           /*!< 0x00002000 */
#define XMC_BK2CTRL_TAR_1                   (0x2U << XMC_BK2CTRL_TAR_Pos)           /*!< 0x00004000 */
#define XMC_BK2CTRL_TAR_2                   (0x4U << XMC_BK2CTRL_TAR_Pos)           /*!< 0x00008000 */
#define XMC_BK2CTRL_TAR_3                   (0x8U << XMC_BK2CTRL_TAR_Pos)           /*!< 0x00010000 */

#define XMC_BK2CTRL_ECCPGS_Pos              (17U)
#define XMC_BK2CTRL_ECCPGS_Msk              (0x7U << XMC_BK2CTRL_ECCPGS_Pos)        /*!< 0x000E0000 */
#define XMC_BK2CTRL_ECCPGS                  XMC_BK2CTRL_ECCPGS_Msk                  /*!< ECCPGS[1:0] bits (ECC page size) */
#define XMC_BK2CTRL_ECCPGS_0                (0x1U << XMC_BK2CTRL_ECCPGS_Pos)        /*!< 0x00020000 */
#define XMC_BK2CTRL_ECCPGS_1                (0x2U << XMC_BK2CTRL_ECCPGS_Pos)        /*!< 0x00040000 */
#define XMC_BK2CTRL_ECCPGS_2                (0x4U << XMC_BK2CTRL_ECCPGS_Pos)        /*!< 0x00080000 */

/******************  Bit definition for XMC_BK2IS register  *******************/
#define XMC_BK2IS_RES_Pos                   (0U)
#define XMC_BK2IS_RES_Msk                   (0x1U << XMC_BK2IS_RES_Pos)             /*!< 0x00000001 */
#define XMC_BK2IS_RES                       XMC_BK2IS_RES_Msk                       /*!< Rising edge status */
#define XMC_BK2IS_HLS_Pos                   (1U)
#define XMC_BK2IS_HLS_Msk                   (0x1U << XMC_BK2IS_HLS_Pos)             /*!< 0x00000002 */
#define XMC_BK2IS_HLS                       XMC_BK2IS_HLS_Msk                       /*!< High-level status */
#define XMC_BK2IS_FES_Pos                   (2U)
#define XMC_BK2IS_FES_Msk                   (0x1U << XMC_BK2IS_FES_Pos)             /*!< 0x00000004 */
#define XMC_BK2IS_FES                       XMC_BK2IS_FES_Msk                       /*!< Falling edge status */
#define XMC_BK2IS_REIEN_Pos                 (3U)
#define XMC_BK2IS_REIEN_Msk                 (0x1U << XMC_BK2IS_REIEN_Pos)           /*!< 0x00000008 */
#define XMC_BK2IS_REIEN                     XMC_BK2IS_REIEN_Msk                     /*!< Rising edge interrupt enable */
#define XMC_BK2IS_HLIEN_Pos                 (4U)
#define XMC_BK2IS_HLIEN_Msk                 (0x1U << XMC_BK2IS_HLIEN_Pos)           /*!< 0x00000010 */
#define XMC_BK2IS_HLIEN                     XMC_BK2IS_HLIEN_Msk                     /*!< High-level interrupt enable */
#define XMC_BK2IS_FEIEN_Pos                 (5U)
#define XMC_BK2IS_FEIEN_Msk                 (0x1U << XMC_BK2IS_FEIEN_Pos)           /*!< 0x00000020 */
#define XMC_BK2IS_FEIEN                     XMC_BK2IS_FEIEN_Msk                     /*!< Falling edge interrupt enable */
#define XMC_BK2IS_FIFOE_Pos                 (6U)
#define XMC_BK2IS_FIFOE_Msk                 (0x1U << XMC_BK2IS_FIFOE_Pos)           /*!< 0x00000040 */
#define XMC_BK2IS_FIFOE                     XMC_BK2IS_FIFOE_Msk                     /*!< FIFO empty */

/*****************  Bit definition for XMC_BK2TMGRG register  *****************/
#define XMC_BK2TMGRG_RGST_Pos               (0U)
#define XMC_BK2TMGRG_RGST_Msk               (0xFFU << XMC_BK2TMGRG_RGST_Pos)        /*!< 0x000000FF */
#define XMC_BK2TMGRG_RGST                   XMC_BK2TMGRG_RGST_Msk                   /*!< RGST[7:0] bits (Regular memory setup time) */
#define XMC_BK2TMGRG_RGST_0                 (0x01U << XMC_BK2TMGRG_RGST_Pos)        /*!< 0x00000001 */
#define XMC_BK2TMGRG_RGST_1                 (0x02U << XMC_BK2TMGRG_RGST_Pos)        /*!< 0x00000002 */
#define XMC_BK2TMGRG_RGST_2                 (0x04U << XMC_BK2TMGRG_RGST_Pos)        /*!< 0x00000004 */
#define XMC_BK2TMGRG_RGST_3                 (0x08U << XMC_BK2TMGRG_RGST_Pos)        /*!< 0x00000008 */
#define XMC_BK2TMGRG_RGST_4                 (0x10U << XMC_BK2TMGRG_RGST_Pos)        /*!< 0x00000010 */
#define XMC_BK2TMGRG_RGST_5                 (0x20U << XMC_BK2TMGRG_RGST_Pos)        /*!< 0x00000020 */
#define XMC_BK2TMGRG_RGST_6                 (0x40U << XMC_BK2TMGRG_RGST_Pos)        /*!< 0x00000040 */
#define XMC_BK2TMGRG_RGST_7                 (0x80U << XMC_BK2TMGRG_RGST_Pos)        /*!< 0x00000080 */

#define XMC_BK2TMGRG_RGWT_Pos               (8U)
#define XMC_BK2TMGRG_RGWT_Msk               (0xFFU << XMC_BK2TMGRG_RGWT_Pos)        /*!< 0x0000FF00 */
#define XMC_BK2TMGRG_RGWT                   XMC_BK2TMGRG_RGWT_Msk                   /*!< RGWT[7:0] bits (Regular memory wait time) */
#define XMC_BK2TMGRG_RGWT_0                 0x00000100U                             /*!< Bit 0 */
#define XMC_BK2TMGRG_RGWT_1                 0x00000200U                             /*!< Bit 1 */
#define XMC_BK2TMGRG_RGWT_2                 0x00000400U                             /*!< Bit 2 */
#define XMC_BK2TMGRG_RGWT_3                 0x00000800U                             /*!< Bit 3 */
#define XMC_BK2TMGRG_RGWT_4                 0x00001000U                             /*!< Bit 4 */
#define XMC_BK2TMGRG_RGWT_5                 0x00002000U                             /*!< Bit 5 */
#define XMC_BK2TMGRG_RGWT_6                 0x00004000U                             /*!< Bit 6 */
#define XMC_BK2TMGRG_RGWT_7                 0x00008000U                             /*!< Bit 7 */

#define XMC_BK2TMGRG_RGHT_Pos               (16U)
#define XMC_BK2TMGRG_RGHT_Msk               (0xFFU << XMC_BK2TMGRG_RGHT_Pos)        /*!< 0x00FF0000 */
#define XMC_BK2TMGRG_RGHT                   XMC_BK2TMGRG_RGHT_Msk                   /*!< RGHT[7:0] bits (Regular memory hold time) */
#define XMC_BK2TMGRG_RGHT_0                 (0x01U << XMC_BK2TMGRG_RGHT_Pos)        /*!< 0x00010000 */
#define XMC_BK2TMGRG_RGHT_1                 (0x02U << XMC_BK2TMGRG_RGHT_Pos)        /*!< 0x00020000 */
#define XMC_BK2TMGRG_RGHT_2                 (0x04U << XMC_BK2TMGRG_RGHT_Pos)        /*!< 0x00040000 */
#define XMC_BK2TMGRG_RGHT_3                 (0x08U << XMC_BK2TMGRG_RGHT_Pos)        /*!< 0x00080000 */
#define XMC_BK2TMGRG_RGHT_4                 (0x10U << XMC_BK2TMGRG_RGHT_Pos)        /*!< 0x00100000 */
#define XMC_BK2TMGRG_RGHT_5                 (0x20U << XMC_BK2TMGRG_RGHT_Pos)        /*!< 0x00200000 */
#define XMC_BK2TMGRG_RGHT_6                 (0x40U << XMC_BK2TMGRG_RGHT_Pos)        /*!< 0x00400000 */
#define XMC_BK2TMGRG_RGHT_7                 (0x80U << XMC_BK2TMGRG_RGHT_Pos)        /*!< 0x00800000 */

#define XMC_BK2TMGRG_RGDHIZT_Pos            (24U)
#define XMC_BK2TMGRG_RGDHIZT_Msk            (0xFFU << XMC_BK2TMGRG_RGDHIZT_Pos)     /*!< 0xFF000000 */
#define XMC_BK2TMGRG_RGDHIZT                XMC_BK2TMGRG_RGDHIZT_Msk                /*!< RGDHIZT[7:0] bits (Regular memory data bus high resistance time) */
#define XMC_BK2TMGRG_RGDHIZT_0              (0x01U << XMC_BK2TMGRG_RGDHIZT_Pos)     /*!< 0x01000000 */
#define XMC_BK2TMGRG_RGDHIZT_1              (0x02U << XMC_BK2TMGRG_RGDHIZT_Pos)     /*!< 0x02000000 */
#define XMC_BK2TMGRG_RGDHIZT_2              (0x04U << XMC_BK2TMGRG_RGDHIZT_Pos)     /*!< 0x04000000 */
#define XMC_BK2TMGRG_RGDHIZT_3              (0x08U << XMC_BK2TMGRG_RGDHIZT_Pos)     /*!< 0x08000000 */
#define XMC_BK2TMGRG_RGDHIZT_4              (0x10U << XMC_BK2TMGRG_RGDHIZT_Pos)     /*!< 0x10000000 */
#define XMC_BK2TMGRG_RGDHIZT_5              (0x20U << XMC_BK2TMGRG_RGDHIZT_Pos)     /*!< 0x20000000 */
#define XMC_BK2TMGRG_RGDHIZT_6              (0x40U << XMC_BK2TMGRG_RGDHIZT_Pos)     /*!< 0x40000000 */
#define XMC_BK2TMGRG_RGDHIZT_7              (0x80U << XMC_BK2TMGRG_RGDHIZT_Pos)     /*!< 0x80000000 */

