HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axg.h
/*******************  Bit definition for USB_EPT1 register  *******************/
#define USB_EPT1_EPTADDR_Pos                (0U)
#define USB_EPT1_EPTADDR_Msk                (0xFU << USB_EPT1_EPTADDR_Pos)          /*!< 0x0000000F */
#define USB_EPT1_EPTADDR                    USB_EPT1_EPTADDR_Msk                    /*!< Endpoint address */

#define USB_EPT1_TXSTS_Pos                  (4U)
#define USB_EPT1_TXSTS_Msk                  (0x3U << USB_EPT1_TXSTS_Pos)            /*!< 0x00000030 */
#define USB_EPT1_TXSTS                      USB_EPT1_TXSTS_Msk                      /*!< TXSTS[1:0] bits (Tx status) */
#define USB_EPT1_TXSTS_0                    (0x1U << USB_EPT1_TXSTS_Pos)            /*!< 0x00000010 */
#define USB_EPT1_TXSTS_1                    (0x2U << USB_EPT1_TXSTS_Pos)            /*!< 0x00000020 */

#define USB_EPT1_TXDTS_Pos                  (6U)
#define USB_EPT1_TXDTS_Msk                  (0x1U << USB_EPT1_TXDTS_Pos)            /*!< 0x00000040 */
#define USB_EPT1_TXDTS                      USB_EPT1_TXDTS_Msk                      /*!< Tx data toggle (DATA0/DATA1) synchronization */
#define USB_EPT1_TXTC_Pos                   (7U)
#define USB_EPT1_TXTC_Msk                   (0x1U << USB_EPT1_TXTC_Pos)             /*!< 0x00000080 */
#define USB_EPT1_TXTC                       USB_EPT1_TXTC_Msk                       /*!< Tx transaction completed */
#define USB_EPT1_EXF_Pos                    (8U)
#define USB_EPT1_EXF_Msk                    (0x1U << USB_EPT1_EXF_Pos)              /*!< 0x00000100 */
#define USB_EPT1_EXF                        USB_EPT1_EXF_Msk                        /*!< Endpoint extend function */

#define USB_EPT1_TRANS_TYPE_Pos             (9U)
#define USB_EPT1_TRANS_TYPE_Msk             (0x3U << USB_EPT1_TRANS_TYPE_Pos)       /*!< 0x00000600 */
#define USB_EPT1_TRANS_TYPE                 USB_EPT1_TRANS_TYPE_Msk                 /*!< TRANS_TYPE[1:0] bits (Transfer type) */
#define USB_EPT1_TRANS_TYPE_0               (0x1U << USB_EPT1_TRANS_TYPE_Pos)       /*!< 0x00000200 */
#define USB_EPT1_TRANS_TYPE_1               (0x2U << USB_EPT1_TRANS_TYPE_Pos)       /*!< 0x00000400 */

#define USB_EPT1_SETUPTC_Pos                (11U)
#define USB_EPT1_SETUPTC_Msk                (0x1U << USB_EPT1_SETUPTC_Pos)          /*!< 0x00000800 */
#define USB_EPT1_SETUPTC                    USB_EPT1_SETUPTC_Msk                    /*!< Setup transaction completed */

#define USB_EPT1_RXSTS_Pos                  (12U)
#define USB_EPT1_RXSTS_Msk                  (0x3U << USB_EPT1_RXSTS_Pos)            /*!< 0x00003000 */
#define USB_EPT1_RXSTS                      USB_EPT1_RXSTS_Msk                      /*!< RXSTS[1:0] bits (Rx status) */
#define USB_EPT1_RXSTS_0                    (0x1U << USB_EPT1_RXSTS_Pos)            /*!< 0x00001000 */
#define USB_EPT1_RXSTS_1                    (0x2U << USB_EPT1_RXSTS_Pos)            /*!< 0x00002000 */

#define USB_EPT1_RXDTS_Pos                  (14U)
#define USB_EPT1_RXDTS_Msk                  (0x1U << USB_EPT1_RXDTS_Pos)            /*!< 0x00004000 */
#define USB_EPT1_RXDTS                      USB_EPT1_RXDTS_Msk                      /*!< Rx data toggle (DATA0/DATA1) synchronization */
#define USB_EPT1_RXTC_Pos                   (15U)
#define USB_EPT1_RXTC_Msk                   (0x1U << USB_EPT1_RXTC_Pos)             /*!< 0x00008000 */
#define USB_EPT1_RXTC                       USB_EPT1_RXTC_Msk                       /*!< Rx transaction completed */

/*******************  Bit definition for USB_EPT2 register  *******************/
#define USB_EPT2_EPTADDR_Pos                (0U)
#define USB_EPT2_EPTADDR_Msk                (0xFU << USB_EPT2_EPTADDR_Pos)          /*!< 0x0000000F */
#define USB_EPT2_EPTADDR                    USB_EPT2_EPTADDR_Msk                    /*!< Endpoint address */

#define USB_EPT2_TXSTS_Pos                  (4U)
#define USB_EPT2_TXSTS_Msk                  (0x3U << USB_EPT2_TXSTS_Pos)            /*!< 0x00000030 */
#define USB_EPT2_TXSTS                      USB_EPT2_TXSTS_Msk                      /*!< TXSTS[1:0] bits (Tx status) */
#define USB_EPT2_TXSTS_0                    (0x1U << USB_EPT2_TXSTS_Pos)            /*!< 0x00000010 */
#define USB_EPT2_TXSTS_1                    (0x2U << USB_EPT2_TXSTS_Pos)            /*!< 0x00000020 */

#define USB_EPT2_TXDTS_Pos                  (6U)
#define USB_EPT2_TXDTS_Msk                  (0x1U << USB_EPT2_TXDTS_Pos)            /*!< 0x00000040 */
#define USB_EPT2_TXDTS                      USB_EPT2_TXDTS_Msk                      /*!< Tx data toggle (DATA0/DATA1) synchronization */
#define USB_EPT2_TXTC_Pos                   (7U)
#define USB_EPT2_TXTC_Msk                   (0x1U << USB_EPT2_TXTC_Pos)             /*!< 0x00000080 */
#define USB_EPT2_TXTC                       USB_EPT2_TXTC_Msk                       /*!< Tx transaction completed */
#define USB_EPT2_EXF_Pos                    (8U)
#define USB_EPT2_EXF_Msk                    (0x1U << USB_EPT2_EXF_Pos)              /*!< 0x00000100 */
#define USB_EPT2_EXF                        USB_EPT2_EXF_Msk                        /*!< Endpoint extend function */

#define USB_EPT2_TRANS_TYPE_Pos             (9U)
#define USB_EPT2_TRANS_TYPE_Msk             (0x3U << USB_EPT2_TRANS_TYPE_Pos)       /*!< 0x00000600 */
#define USB_EPT2_TRANS_TYPE                 USB_EPT2_TRANS_TYPE_Msk                 /*!< TRANS_TYPE[1:0] bits (Transfer type) */
#define USB_EPT2_TRANS_TYPE_0               (0x1U << USB_EPT2_TRANS_TYPE_Pos)       /*!< 0x00000200 */
#define USB_EPT2_TRANS_TYPE_1               (0x2U << USB_EPT2_TRANS_TYPE_Pos)       /*!< 0x00000400 */

#define USB_EPT2_SETUPTC_Pos                (11U)
#define USB_EPT2_SETUPTC_Msk                (0x1U << USB_EPT2_SETUPTC_Pos)          /*!< 0x00000800 */
#define USB_EPT2_SETUPTC                    USB_EPT2_SETUPTC_Msk                    /*!< Setup transaction completed */

#define USB_EPT2_RXSTS_Pos                  (12U)
#define USB_EPT2_RXSTS_Msk                  (0x3U << USB_EPT2_RXSTS_Pos)            /*!< 0x00003000 */
#define USB_EPT2_RXSTS                      USB_EPT2_RXSTS_Msk                      /*!< RXSTS[1:0] bits (Rx status) */
#define USB_EPT2_RXSTS_0                    (0x1U << USB_EPT2_RXSTS_Pos)            /*!< 0x00001000 */
#define USB_EPT2_RXSTS_1                    (0x2U << USB_EPT2_RXSTS_Pos)            /*!< 0x00002000 */

#define USB_EPT2_RXDTS_Pos                  (14U)
#define USB_EPT2_RXDTS_Msk                  (0x1U << USB_EPT2_RXDTS_Pos)            /*!< 0x00004000 */
#define USB_EPT2_RXDTS                      USB_EPT2_RXDTS_Msk                      /*!< Rx data toggle (DATA0/DATA1) synchronization */
#define USB_EPT2_RXTC_Pos                   (15U)
#define USB_EPT2_RXTC_Msk                   (0x1U << USB_EPT2_RXTC_Pos)             /*!< 0x00008000 */
#define USB_EPT2_RXTC                       USB_EPT2_RXTC_Msk                       /*!< Rx transaction completed */

/*******************  Bit definition for USB_EPT3 register  *******************/
#define USB_EPT3_EPTADDR_Pos                (0U)
#define USB_EPT3_EPTADDR_Msk                (0xFU << USB_EPT3_EPTADDR_Pos)          /*!< 0x0000000F */
#define USB_EPT3_EPTADDR                    USB_EPT3_EPTADDR_Msk                    /*!< Endpoint address */

