HorrorTroll/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F40xx/at32f403axg.h
#define USB_R7LEN_NBLK_Pos                  (10U)
#define USB_R7LEN_NBLK_Msk                  (0x1FU << USB_R7LEN_NBLK_Pos)           /*!< 0x00007C00 */
#define USB_R7LEN_NBLK                      USB_R7LEN_NBLK_Msk                      /*!< NBLK[4:0] bits (Number of blocks) */
#define USB_R7LEN_NBLK_0                    (0x01U << USB_R7LEN_NBLK_Pos)           /*!< 0x00000400 */
#define USB_R7LEN_NBLK_1                    (0x02U << USB_R7LEN_NBLK_Pos)           /*!< 0x00000800 */
#define USB_R7LEN_NBLK_2                    (0x04U << USB_R7LEN_NBLK_Pos)           /*!< 0x00001000 */
#define USB_R7LEN_NBLK_3                    (0x08U << USB_R7LEN_NBLK_Pos)           /*!< 0x00002000 */
#define USB_R7LEN_NBLK_4                    (0x10U << USB_R7LEN_NBLK_Pos)           /*!< 0x00004000 */

#define USB_R7LEN_BSIZE_Pos                 (15U)
#define USB_R7LEN_BSIZE_Msk                 (0x1U << USB_R7LEN_BSIZE_Pos)           /*!< 0x00008000 */
#define USB_R7LEN_BSIZE                     USB_R7LEN_BSIZE_Msk                     /*!< Block size */

/*----------------------------------------------------------------------------*/

/*****************  Bit definition for USB_R0LEN_0 register  ******************/
#define USB_R0LEN_0_R0LEN_0                 0x000003FFU                             /*!< Reception Length 0 (low) */

#define USB_R0LEN_0_NBLK_0                  0x00007C00U                             /*!< NBLK_0[4:0] bits (Number of blocks) (low) */
#define USB_R0LEN_0_NBLK_0_0                0x00000400U                             /*!< Bit 0 */
#define USB_R0LEN_0_NBLK_0_1                0x00000800U                             /*!< Bit 1 */
#define USB_R0LEN_0_NBLK_0_2                0x00001000U                             /*!< Bit 2 */
#define USB_R0LEN_0_NBLK_0_3                0x00002000U                             /*!< Bit 3 */
#define USB_R0LEN_0_NBLK_0_4                0x00004000U                             /*!< Bit 4 */

#define USB_R0LEN_0_BSIZE_0                 0x00008000U                             /*!< Block size (low) */

/*****************  Bit definition for USB_R0LEN_1 register  ******************/
#define USB_R0LEN_1_R0LEN_1                 0x03FF0000U                             /*!< Reception Length 0 (high) */

#define USB_R0LEN_1_NBLK_1                  0x7C000000U                             /*!< NBLK_1[4:0] bits (Number of blocks) (high) */
#define USB_R0LEN_1_NBLK_1_0                0x04000000U                             /*!< Bit 1 */
#define USB_R0LEN_1_NBLK_1_1                0x08000000U                             /*!< Bit 1 */
#define USB_R0LEN_1_NBLK_1_2                0x10000000U                             /*!< Bit 2 */
#define USB_R0LEN_1_NBLK_1_3                0x20000000U                             /*!< Bit 3 */
#define USB_R0LEN_1_NBLK_1_4                0x40000000U                             /*!< Bit 4 */

#define USB_R0LEN_1_BSIZE_1                 0x80000000U                             /*!< Block size (high) */

/*****************  Bit definition for USB_R1LEN_0 register  ******************/
#define USB_R1LEN_0_R1LEN_0                 0x000003FFU                             /*!< Reception Length 1 (low) */

#define USB_R1LEN_0_NBLK_0                  0x00007C00U                             /*!< NBLK_0[4:0] bits (Number of blocks) (low) */
#define USB_R1LEN_0_NBLK_0_0                0x00000400U                             /*!< Bit 0 */
#define USB_R1LEN_0_NBLK_0_1                0x00000800U                             /*!< Bit 1 */
#define USB_R1LEN_0_NBLK_0_2                0x00001000U                             /*!< Bit 2 */
#define USB_R1LEN_0_NBLK_0_3                0x00002000U                             /*!< Bit 3 */
#define USB_R1LEN_0_NBLK_0_4                0x00004000U                             /*!< Bit 4 */

#define USB_R1LEN_0_BSIZE_0                 0x00008000U                             /*!< Block size (low) */

/*****************  Bit definition for USB_R1LEN_1 register  ******************/
#define USB_R1LEN_1_R1LEN_1                 0x03FF0000U                             /*!< Reception Length 1 (high) */

#define USB_R1LEN_1_NBLK_1                  0x7C000000U                             /*!< NBLK_1[4:0] bits (Number of blocks) (high) */
#define USB_R1LEN_1_NBLK_1_0                0x04000000U                             /*!< Bit 0 */
#define USB_R1LEN_1_NBLK_1_1                0x08000000U                             /*!< Bit 1 */
#define USB_R1LEN_1_NBLK_1_2                0x10000000U                             /*!< Bit 2 */
#define USB_R1LEN_1_NBLK_1_3                0x20000000U                             /*!< Bit 3 */
#define USB_R1LEN_1_NBLK_1_4                0x40000000U                             /*!< Bit 4 */

#define USB_R1LEN_1_BSIZE_1                 0x80000000U                             /*!< Block size (high) */

/*****************  Bit definition for USB_R2LEN_0 register  ******************/
#define USB_R2LEN_0_R2LEN_0                 0x000003FFU                             /*!< Reception Length 2 (low) */

#define USB_R2LEN_0_NBLK_0                  0x00007C00U                             /*!< NBLK_0[4:0] bits (Number of blocks) (low) */
#define USB_R2LEN_0_NBLK_0_0                0x00000400U                             /*!< Bit 0 */
#define USB_R2LEN_0_NBLK_0_1                0x00000800U                             /*!< Bit 1 */
#define USB_R2LEN_0_NBLK_0_2                0x00001000U                             /*!< Bit 2 */
#define USB_R2LEN_0_NBLK_0_3                0x00002000U                             /*!< Bit 3 */
#define USB_R2LEN_0_NBLK_0_4                0x00004000U                             /*!< Bit 4 */

#define USB_R2LEN_0_BSIZE_0                 0x00008000U                             /*!< Block size (low) */

/*****************  Bit definition for USB_R2LEN_1 register  ******************/
#define USB_R2LEN_1_R2LEN_1                 0x03FF0000U                             /*!< Reception Length 2 (high) */

#define USB_R2LEN_1_NBLK_1                  0x7C000000U                             /*!< NBLK_1[4:0] bits (Number of blocks) (high) */
#define USB_R2LEN_1_NBLK_1_0                0x04000000U                             /*!< Bit 0 */
#define USB_R2LEN_1_NBLK_1_1                0x08000000U                             /*!< Bit 1 */
#define USB_R2LEN_1_NBLK_1_2                0x10000000U                             /*!< Bit 2 */
#define USB_R2LEN_1_NBLK_1_3                0x20000000U                             /*!< Bit 3 */
#define USB_R2LEN_1_NBLK_1_4                0x40000000U                             /*!< Bit 4 */

#define USB_R2LEN_1_BSIZE_1                 0x80000000U                             /*!< Block size (high) */

/*****************  Bit definition for USB_R3LEN_0 register  ******************/
#define USB_R3LEN_0_R3LEN_0                 0x000003FFU                             /*!< Reception Length 3 (low) */

